{
"j": [
{
"partOfSpeech": "",
"text": "J is the tenth letter of the English alphabet. It is a later variant form of the Roman letter I, used to express a consonantal sound, that is, originally, the sound of English y in yet. The forms J and I have, until a recent time, been classed together, and they have been used interchangeably."
}
],
"jaal goat": [
{
"partOfSpeech": "",
"text": "A species of wild goatCapra Nubiana) found in the mountains of Abyssinia, Upper Egypt, and Arabia; -- called also beden, and jaela."
}
],
"jab": [
{
"partOfSpeech": "v. t.",
"text": "To thrust; to stab; to punch. See Job, v. t."
},
{
"partOfSpeech": "n.",
"text": "A thrust or stab."
}
],
"jabbered": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jabber"
}
],
"jabbering": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jabber"
}
],
"jabber": [
{
"partOfSpeech": "v. i.",
"text": "To talk rapidly, indistinctly, or unintelligibly; to utter gibberish or nonsense; to chatter."
},
{
"partOfSpeech": "v. t.",
"text": "To utter rapidly or indistinctly; to gabble; as, to jabber French."
},
{
"partOfSpeech": "n.",
"text": "Rapid or incoherent talk, with indistinct utterance; gibberish."
},
{
"partOfSpeech": "n.",
"text": "One who jabbers."
}
],
"jabberingly": [
{
"partOfSpeech": "adv.",
"text": "In a jabbering manner."
}
],
"jabberment": [
{
"partOfSpeech": "n.",
"text": "Jabber."
}
],
"jabbernowl": [
{
"partOfSpeech": "n.",
"text": "Same as Jobbernowl."
}
],
"jabiru": [
{
"partOfSpeech": "n.",
"text": "One of several large wading birds of the genera Mycteria and Xenorhynchus, allied to the storks in form and habits."
}
],
"jaborandi": [
{
"partOfSpeech": "n.",
"text": "The native name of a South American rutaceous shrubPilocarpus pennatifolius). The leaves are used in medicine as an diaphoretic and sialogogue."
}
],
"jaborine": [
{
"partOfSpeech": "n.",
"text": "An alkaloid found in jaborandi leaves, from which it is extracted as a white amorphous substance. In its action it resembles atropine."
}
],
"jabot": [
{
"partOfSpeech": "n.",
"text": "Originally, a kind of ruffle worn by men on the bosom of the shirt."
},
{
"partOfSpeech": "n.",
"text": "An arrangement of lace or tulle, looped ornamentally, and worn by women on the front of the dress."
}
],
"jacamar": [
{
"partOfSpeech": "n.",
"text": "Any one of numerous species of tropical American birds of the genus Galbula and allied genera. They are allied to the kingfishers, but climb on tree trunks like nuthatches, and feed upon insects. Their colors are often brilliant."
}
],
"jacana": [
{
"partOfSpeech": "n.",
"text": "Any of several wading birds belonging to the genus Jacana and several allied genera, all of which have spurs on the wings. They are able to run about over floating water weeds by means of their very long, spreading toes. Called also surgeon bird."
}
],
"jacaranda": [
{
"partOfSpeech": "n.",
"text": "The native Brazilian name for certain leguminous trees, which produce the beautiful woods called king wood, tiger wood, and violet wood."
},
{
"partOfSpeech": "n.",
"text": "A genus of bignoniaceous Brazilian trees with showy trumpet-shaped flowers."
}
],
"jacare": [
{
"partOfSpeech": "n.",
"text": "A cayman. See Yacare."
}
],
"jacchus": [
{
"partOfSpeech": "n.",
"text": "The common marmosetHapale vulgaris). Formerly, the name was also applied to other species of the same genus."
}
],
"jacconet": [
{
"partOfSpeech": "n.",
"text": "See Jaconet."
}
],
"jacent": [
{
"partOfSpeech": "a.",
"text": "Lying at length; as, the jacent posture."
}
],
"jacinth": [
{
"partOfSpeech": "n.",
"text": "See Hyacinth."
}
],
"jack": [
{
"partOfSpeech": "n.",
"text": "A large tree, the Artocarpus integrifolia, common in the East Indies, closely allied to the breadfruit, from which it differs in having its leaves entire. The fruit is of great size, weighing from thirty to forty pounds, and through its soft fibrous matter are scattered the seeds, which are roasted and eaten. The wood is of a yellow color, fine grain, and rather heavy, and is much used in cabinetwork. It is also used for dyeing a brilliant yellow."
},
{
"partOfSpeech": "n.",
"text": "A familiar nickname of, or substitute for, John."
},
{
"partOfSpeech": "n.",
"text": "An impertinent or silly fellow; a simpleton; a boor; a clown; also, a servant; a rustic."
},
{
"partOfSpeech": "n.",
"text": "A popular colloquial name for a sailor; -- called also Jack tar, and Jack afloat."
},
{
"partOfSpeech": "n.",
"text": "A mechanical contrivance, an auxiliary machine, or a subordinate part of a machine, rendering convenient service, and often supplying the place of a boy or attendant who was commonly called Jack"
},
{
"partOfSpeech": "n.",
"text": "A device to pull off boots."
},
{
"partOfSpeech": "n.",
"text": "A sawhorse or sawbuck."
},
{
"partOfSpeech": "n.",
"text": "A machine or contrivance for turning a spit; a smoke jack, or kitchen jack."
},
{
"partOfSpeech": "n.",
"text": "A wooden wedge for separating rocks rent by blasting."
},
{
"partOfSpeech": "n.",
"text": "A lever for depressing the sinkers which push the loops down on the needles."
},
{
"partOfSpeech": "n.",
"text": "A grating to separate and guide the threads; a heck box."
},
{
"partOfSpeech": "n.",
"text": "A machine for twisting the sliver as it leaves the carding machine."
},
{
"partOfSpeech": "n.",
"text": "A compact, portable machine for planing metal."
},
{
"partOfSpeech": "n.",
"text": "A machine for slicking or pebbling leather."
},
{
"partOfSpeech": "n.",
"text": "A system of gearing driven by a horse power, for multiplying speed."
},
{
"partOfSpeech": "n.",
"text": "A hood or other device placed over a chimney or vent pipe, to prevent a back draught."
},
{
"partOfSpeech": "n.",
"text": "In the harpsichord, an intermediate piece communicating the action of the key to the quill; -- called also hopper."
},
{
"partOfSpeech": "n.",
"text": "In hunting, the pan or frame holding the fuel of the torch used to attract game at night; also, the light itself."
},
{
"partOfSpeech": "n.",
"text": "A portable machine variously constructed, for exerting great pressure, or lifting or moving a heavy body through a small distance. It consists of a lever, screw, rack and pinion, hydraulic press, or any simple combination of mechanical powers, working in a compact pedestal or support and operated by a lever, crank, capstan bar, etc. The name is often given to a jackscrew, which is a kind of jack."
},
{
"partOfSpeech": "n.",
"text": "The small bowl used as a mark in the game of bowls."
},
{
"partOfSpeech": "n.",
"text": "The male of certain animals, as of the ass."
},
{
"partOfSpeech": "n.",
"text": "A young pike; a pickerel."
},
{
"partOfSpeech": "n.",
"text": "The jurel."
},
{
"partOfSpeech": "n.",
"text": "A large, California rock fishSebastodes paucispinus); -- called also boccaccio, and merou."
},
{
"partOfSpeech": "n.",
"text": "The wall-eyed pike."
},
{
"partOfSpeech": "n.",
"text": "A drinking measure holding half a pint; also, one holding a quarter of a pint."
},
{
"partOfSpeech": "n.",
"text": "A flag, containing only the union, without the fly, usually hoisted on a jack staff at the bowsprit cap; -- called also union jack. The American jack is a small blue flag, with a star for each State."
},
{
"partOfSpeech": "n.",
"text": "A bar of iron athwart ships at a topgallant masthead, to support a royal mast, and give spread to the royal shrouds; -- called also jack crosstree."
},
{
"partOfSpeech": "n.",
"text": "The knave of a suit of playing cards."
},
{
"partOfSpeech": "n.",
"text": "A coarse and cheap mediaeval coat of defense, esp. one made of leather."
},
{
"partOfSpeech": "n.",
"text": "A pitcher or can of waxed leather; -- called also black jack."
},
{
"partOfSpeech": "v. i.",
"text": "To hunt game at night by means of a jack. See 2d Jack, n., 4, n."
},
{
"partOfSpeech": "v. t.",
"text": "To move or lift, as a house, by means of a jack or jacks. See 2d Jack, n., 5."
}
],
"jack-a-dandy": [
{
"partOfSpeech": "n.",
"text": "A little dandy; a little, foppish, impertinent fellow."
}
],
"jackal": [
{
"partOfSpeech": "n.",
"text": "Any one of several species of carnivorous animals inhabiting Africa and Asia, related to the dog and wolf. They are cowardly, nocturnal, and gregarious. They feed largely on carrion, and are noted for their piercing and dismal howling."
},
{
"partOfSpeech": "n.",
"text": "One who does mean work for another's advantage, as jackals were once thought to kill game which lions appropriated."
}
],
"jack-a-lent": [
{
"partOfSpeech": "n.",
"text": "A small stuffed puppet to be pelted in Lent; hence, a simple fellow."
}
],
"jackanapes": [
{
"partOfSpeech": "n.",
"text": "A monkey; an ape."
},
{
"partOfSpeech": "n.",
"text": "A coxcomb; an impertinent or conceited fellow."
}
],
"jackass": [
{
"partOfSpeech": "n.",
"text": "The male ass; a donkey."
},
{
"partOfSpeech": "n.",
"text": "A conceited dolt; a perverse blockhead."
}
],
"jackdaw": [
{
"partOfSpeech": "n.",
"text": "See Daw, n."
}
],
"jackeen": [
{
"partOfSpeech": "n.",
"text": "A drunken, dissolute fellow."
}
],
"jacket": [
{
"partOfSpeech": "n.",
"text": "A short upper garment, extending downward to the hips; a short coat without skirts."
},
{
"partOfSpeech": "n.",
"text": "An outer covering for anything, esp. a covering of some nonconducting material such as wood or felt, used to prevent radiation of heat, as from a steam boiler, cylinder, pipe, etc."
},
{
"partOfSpeech": "n.",
"text": "In ordnance, a strengthening band surrounding and reenforcing the tube in which the charge is fired."
},
{
"partOfSpeech": "n.",
"text": "A garment resembling a waistcoat lined with cork, to serve as a life preserver; -- called also cork jacket."
},
{
"partOfSpeech": "v. t.",
"text": "To put a jacket on; to furnish, as a boiler, with a jacket."
},
{
"partOfSpeech": "v. t.",
"text": "To thrash; to beat."
}
],
"jacketed": [
{
"partOfSpeech": "a.",
"text": "Wearing, or furnished with, a jacket."
}
],
"jacketing": [
{
"partOfSpeech": "n.",
"text": "The material of a jacket; as, nonconducting jacketing."
}
],
"jack ketch": [
{
"partOfSpeech": "",
"text": "A public executioner, or hangman."
}
],
"jackknife": [
{
"partOfSpeech": "n.",
"text": "A large, strong clasp knife for the pocket; a pocket knife."
}
],
"jackmen": [
{
"partOfSpeech": "pl. ",
"text": "of Jackman"
}
],
"jackman": [
{
"partOfSpeech": "n.",
"text": "One wearing a jack; a horse soldier; a retainer. See 3d Jack, n."
},
{
"partOfSpeech": "n.",
"text": "A cream cheese."
}
],
"jack-o'-lantern": [
{
"partOfSpeech": "n.",
"text": "See Jack-with-a-lantern, under 2d Jack."
}
],
"jackpudding": [
{
"partOfSpeech": "n.",
"text": "A merry-andrew; a buffoon."
}
],
"jacksaw": [
{
"partOfSpeech": "n.",
"text": "The merganser."
}
],
"jackscrew": [
{
"partOfSpeech": "n.",
"text": "A jack in which a screw is used for lifting, or exerting pressure. See Illust. of 2d Jack, n., 5."
}
],
"jackslave": [
{
"partOfSpeech": "n.",
"text": "A low servant; a mean fellow."
}
],
"jacksmith": [
{
"partOfSpeech": "n.",
"text": "A smith who makes jacks. See 2d Jack, 4, c."
}
],
"jacksnipe": [
{
"partOfSpeech": "n.",
"text": "A small European snipeLimnocryptes gallinula); -- called also judcock, jedcock, juddock, jed, and half snipe."
},
{
"partOfSpeech": "n.",
"text": "A small American sandpiperTringa maculata); -- called also pectoral sandpiper, and grass snipe."
}
],
"jackstay": [
{
"partOfSpeech": "n.",
"text": "A rail of wood or iron stretching along a yard of a vessel, to which the sails are fastened."
}
],
"jackstone": [
{
"partOfSpeech": "n.",
"text": "One of the pebbles or pieces used in the game of jackstones."
},
{
"partOfSpeech": "n.",
"text": "A game played with five small stones or pieces of metal. See 6th Chuck."
}
],
"jackstraw": [
{
"partOfSpeech": "n.",
"text": "An effigy stuffed with straw; a scarecrow; hence, a man without property or influence."
},
{
"partOfSpeech": "n.",
"text": "One of a set of straws of strips of ivory, bone, wood, etc., for playing a child's game, the jackstraws being thrown confusedly together on a table, to be gathered up singly by a hooked instrument, without touching or disturbing the rest of the pile. See Spilikin."
}
],
"jackwood": [
{
"partOfSpeech": "n.",
"text": "Wood of the jackArtocarpus integrifolia), used in cabinetwork."
}
],
"jacob": [
{
"partOfSpeech": "n.",
"text": "A Hebrew patriarchson of Isaac, and ancestor of the Jews), who in a vision saw a ladder reaching up to heavenGen. xxviii. 12); -- also called Israel."
}
],
"jacobaean lily": [
{
"partOfSpeech": "",
"text": "A bulbous plant Amaryllis, / Sprekelia, formosissima) from Mexico. It bears a single, large, deep, red, lilylike flower."
}
],
"jacobean": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jacobian"
}
],
"jacobian": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to a style of architecture and decoration in the time of James the First, of England."
}
],
"jacobin": [
{
"partOfSpeech": "n.",
"text": "A Dominican friar; -- so named because, before the French Revolution, that order had a convent in the Rue St. Jacques, Paris."
},
{
"partOfSpeech": "n.",
"text": "One of a society of violent agitators in France, during the revolution of 1789, who held secret meetings in the Jacobin convent in the Rue St. Jacques, Paris, and concerted measures to control the proceedings of the National Assembly. Hence: A plotter against an existing government; a turbulent demagogue."
},
{
"partOfSpeech": "n.",
"text": "A fancy pigeon, in which the feathers of the neck form a hood, -- whence the name. The wings and tail are long, and the beak moderately short."
},
{
"partOfSpeech": "a.",
"text": "Same as Jacobinic."
}
],
"jacobine": [
{
"partOfSpeech": "n.",
"text": "A Jacobin."
}
],
"jacobinic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jacobinical"
}
],
"jacobinical": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jacobins of France; revolutionary; of the nature of, or characterized by, Jacobinism."
}
],
"jacobinism": [
{
"partOfSpeech": "n.",
"text": "The  principles of the Jacobins; violent and factious opposition to legitimate government."
}
],
"jacobinized": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jacobinize"
}
],
"jacobinizing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jacobinize"
}
],
"jacobinize": [
{
"partOfSpeech": "v. t.",
"text": "To taint with, or convert to, Jacobinism."
}
],
"jacobite": [
{
"partOfSpeech": "n.",
"text": "A partisan or adherent of James the Second, after his abdication, or of his descendants, an opposer of the revolution in 1688 in favor of William and Mary."
},
{
"partOfSpeech": "n.",
"text": "One of the sect of Syrian Monophysites. The sect is named after Jacob Baradaeus, its leader in the  sixth century."
},
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jacobites."
}
],
"jacobitic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jacobitical"
}
],
"jacobitical": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jacobites; characterized by Jacobitism."
}
],
"jacobitism": [
{
"partOfSpeech": "n.",
"text": "The principles of the Jacobites."
}
],
"jacobuses": [
{
"partOfSpeech": "pl. ",
"text": "of Jacobus"
}
],
"jacobus": [
{
"partOfSpeech": "n.",
"text": "An English gold coin, of the value of twenty-five shillings sterling, struck in the reign of James I."
}
],
"jaconet": [
{
"partOfSpeech": "n.",
"text": "A thin cotton fabric, between and muslin, used for dresses, neckcloths, etc."
}
],
"jacquard": [
{
"partOfSpeech": "a.",
"text": "Pertaining to, or invented by, Jacquard, a French mechanician, who died in 1834."
}
],
"jacqueminot": [
{
"partOfSpeech": "n.",
"text": "A half-hardy, deep crimson  rose of the remontant class; -- so named after General Jacqueminot, of France."
}
],
"jacquerie": [
{
"partOfSpeech": "n.",
"text": "The name given to a revolt of French peasants against the nobles in 1358, the leader assuming the contemptuous title, Jacques Bonhomme, given by the nobles to the peasantry. Hence, any revolt of peasants."
}
],
"jactancy": [
{
"partOfSpeech": "n.",
"text": "A boasting; a bragging."
}
],
"jactation": [
{
"partOfSpeech": "n.",
"text": "A throwing or tossing of the body; a shaking or agitation."
}
],
"jactitation": [
{
"partOfSpeech": "n.",
"text": "Vain boasting or assertions repeated to the prejudice of another's right; false claim."
},
{
"partOfSpeech": "n.",
"text": "A frequent tossing or moving of the body; restlessness, as in delirium."
}
],
"jaculable": [
{
"partOfSpeech": "a.",
"text": "Fit for throwing."
}
],
"jaculated": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jaculate"
}
],
"jaculating": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jaculate"
}
],
"jaculate": [
{
"partOfSpeech": "v. t.",
"text": "To throw or cast, as a dart; to throw out; to emit."
}
],
"jaculation": [
{
"partOfSpeech": "n.",
"text": "The act of tossing, throwing, or hurling, as spears."
}
],
"jaculator": [
{
"partOfSpeech": "",
"text": "One who throws or casts."
},
{
"partOfSpeech": "",
"text": "The archer fishToxotes jaculator)."
}
],
"jaculatory": [
{
"partOfSpeech": "a.",
"text": "Darting or throwing out suddenly; also, suddenly thrown out; uttered in short sentences; ejaculatory; as, jaculatory prayers."
}
],
"jadding": [
{
"partOfSpeech": "n.",
"text": "See Holing."
}
],
"jade": [
{
"partOfSpeech": "n.",
"text": "A stone, commonly of a pale to dark green color but sometimes whitish. It is very hard and compact, capable of fine polish, and is used for ornamental purposes and for implements, esp. in Eastern countries and among many early peoples."
},
{
"partOfSpeech": "n.",
"text": "A mean or tired horse; a worthless nag."
},
{
"partOfSpeech": "n.",
"text": "A disreputable or vicious woman; a wench; a quean; also, sometimes, a worthless man."
},
{
"partOfSpeech": "n.",
"text": "A young woman; -- generally so called in irony or slight contempt."
},
{
"partOfSpeech": "v. t.",
"text": "To treat like a jade; to spurn."
},
{
"partOfSpeech": "v. t.",
"text": "To make ridiculous and contemptible."
},
{
"partOfSpeech": "v. t.",
"text": "To exhaust by overdriving or long-continued labor of any kind; to tire or wear out by severe or tedious tasks; to harass."
},
{
"partOfSpeech": "v. i.",
"text": "To become weary; to lose spirit."
}
],
"jaded": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jade"
}
],
"jading": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jade"
}
],
"jadeite": [
{
"partOfSpeech": "n.",
"text": "See Jade, the stone."
}
],
"jadery": [
{
"partOfSpeech": "n.",
"text": "The tricks of a jade."
}
],
"jadish": [
{
"partOfSpeech": "a.",
"text": "Vicious; ill-tempered; resembling a jade; -- applied to a horse."
},
{
"partOfSpeech": "a.",
"text": "Unchaste; -- applied to a woman."
}
],
"jaeger": [
{
"partOfSpeech": "n.",
"text": "See Jager."
}
],
"jag": [
{
"partOfSpeech": "n.",
"text": "A notch; a cleft; a barb; a ragged or sharp protuberance; a denticulation."
},
{
"partOfSpeech": "n.",
"text": "A part broken off; a fragment."
},
{
"partOfSpeech": "n.",
"text": "A cleft or division."
},
{
"partOfSpeech": "v. t.",
"text": "To cut into notches or teeth like those of a saw; to notch."
},
{
"partOfSpeech": "n.",
"text": "A small load, as of hay or grain in the straw, or of ore."
},
{
"partOfSpeech": "v. t.",
"text": "To carry, as a load; as, to jag hay, etc."
},
{
"partOfSpeech": "n.",
"text": "A leather bag or wallet;"
},
{
"partOfSpeech": "n.",
"text": "saddlebags."
},
{
"partOfSpeech": "n.",
"text": "Enough liquor to make a man noticeably drunk; a small \"load;\" a time or case of drunkeness; -- esp. in phr. To have a jag on, to be drunk."
}
],
"jagged": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jag"
},
{
"partOfSpeech": "a.",
"text": "Having jags; having rough, sharp notches, protuberances, or teeth; cleft; laciniate; divided; as, jagged rocks."
}
],
"jagging": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jag"
}
],
"jaganatha": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jaganatha"
},
{
"partOfSpeech": "n.",
"text": "See Juggernaut."
}
],
"jager": [
{
"partOfSpeech": "n.",
"text": "A sharpshooter. See Yager."
},
{
"partOfSpeech": "n.",
"text": "Any species of gull of the genus Stercorarius. Three species occur on the Atlantic coast. The jagers pursue other species of gulls and force them to disgorge their prey. The two middle tail feathers are usually decidedly longer than the rest. Called also boatswain, and marline-spike bird. The name is also applied to the skua, or Arctic gullMegalestris skua)."
}
],
"jagg": [
{
"partOfSpeech": "v. t. & n.",
"text": "See Jag."
}
],
"jagger": [
{
"partOfSpeech": "n.",
"text": "One who carries about a small load; a peddler. See 2d Jag."
},
{
"partOfSpeech": "n.",
"text": "One who, or that which, jags; specifically:a) jagging iron used for crimping pies, cakes, etc.b) A toothed chisel. See Jag, v. t."
}
],
"jaggery": [
{
"partOfSpeech": "n.",
"text": "Raw palm sugar, made in the East Indies by evaporating the fresh juice of several kinds of palm trees, but specifically that of the palmyraBorassus flabelliformis)."
}
],
"jaggy": [
{
"partOfSpeech": "a.",
"text": "Having jags; set with teeth; notched; uneven; as, jaggy teeth."
}
],
"jaghir": [
{
"partOfSpeech": "n.",
"text": "A village or district the government and revenues of which are assigned to some person, usually in consideration of some service to be rendered, esp. the maintenance of troops."
}
],
"jaghirdar": [
{
"partOfSpeech": "n.",
"text": "The holder of a jaghir."
}
],
"jagua palm": [
{
"partOfSpeech": "",
"text": "A great Brazilian palmMaximiliana regia), having immense spathes which are used for baskets and tubs."
}
],
"jaguar": [
{
"partOfSpeech": "n.",
"text": "A large and powerful feline animalFelis onca), ranging from Texas and Mexico to Patagonia. It is usually brownish yellow, with large, dark, somewhat angular rings, each generally inclosing one or two dark spots. It is chiefly arboreal in its habits. Called also the American tiger."
}
],
"jaguarondi": [
{
"partOfSpeech": "n.",
"text": "A South American wild catFelis jaguarondi), having a long, slim body and very short legs. Its color is grayish brown, varied with a blackish hue. It is arboreal in its habits and feeds mostly on birds."
}
],
"jah": [
{
"partOfSpeech": "n.",
"text": "Jehovah."
}
],
"jail": [
{
"partOfSpeech": "n.",
"text": "A kind of prison; a building for the confinement of persons held in lawful  custody, especially for minor offenses or with reference to some future judicial proceeding."
},
{
"partOfSpeech": "v. t.",
"text": "To imprison."
}
],
"jailer": [
{
"partOfSpeech": "n.",
"text": "The keeper of a jail or prison."
}
],
"jain": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jaina"
}
],
"jaina": [
{
"partOfSpeech": "n.",
"text": "One of a numerous sect in British India, holding the tenets of Jainism."
}
],
"jainism": [
{
"partOfSpeech": "n.",
"text": "The heterodox Hindoo religion, of which the most striking features are the exaltation of saints or holy mortals, called jins, above the ordinary Hindoo gods, and the denial of the divine origin and infallibility of the Vedas. It is intermediate between Brahmanism and Buddhism, having some things in common with each."
}
],
"jairou": [
{
"partOfSpeech": "n.",
"text": "The ahu or Asiatic gazelle."
}
],
"jak": [
{
"partOfSpeech": "n.",
"text": "see Ils Jack."
}
],
"jakes": [
{
"partOfSpeech": "n.",
"text": "A privy."
}
],
"jakie": [
{
"partOfSpeech": "n.",
"text": "A South American striped frogPseudis paradoxa), remarkable for having a tadpole larger than the adult, and hence called also paradoxical frog."
}
],
"jako": [
{
"partOfSpeech": "n.",
"text": "An African parrotPsittacus erithacus), very commonly kept as a cage bird; -- called also gray parrot."
}
],
"jakwood": [
{
"partOfSpeech": "n.",
"text": "See Jackwood."
}
],
"jalap": [
{
"partOfSpeech": "n.",
"text": "The tubers of the Mexican plant Ipomoea purgaor Exogonium purga), a climber much like the morning-glory. The abstract, extract, and powder, prepared from the tubers, are well known purgative medicines. Other species of Ipomoea yield several inferior kinds of jalap, as the I. Orizabensis, and I. tuberosa."
}
],
"jalapic": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to jalap."
}
],
"jalapin": [
{
"partOfSpeech": "n.",
"text": "A glucoside found in the stems of the jalap plant and scammony. It is a strong purgative."
}
],
"jalons": [
{
"partOfSpeech": "n. pl.",
"text": "Long poles, topped with wisps of straw, used as landmarks and signals."
}
],
"jalousie": [
{
"partOfSpeech": "n.",
"text": "A Venetian or slatted inside window blind."
}
],
"jalousied": [
{
"partOfSpeech": "a.",
"text": "Furnished with jalousies; as, jalousied porches."
}
],
"jam": [
{
"partOfSpeech": "n.",
"text": "A kind of frock for children."
},
{
"partOfSpeech": "n.",
"text": "See Jamb."
},
{
"partOfSpeech": "v. t.",
"text": "To press into a close or tight position; to crowd; to squeeze; to wedge in."
},
{
"partOfSpeech": "v. t.",
"text": "To crush or bruise; as, to jam a finger in the crack of a door."
},
{
"partOfSpeech": "v. t.",
"text": "To bringa vessel) so close to the wind that half her upper sails are laid aback."
},
{
"partOfSpeech": "n.",
"text": "A mass of people or objects crowded together; also, the pressure from a crowd; a crush; as, a jam in a street; a jam of logs in a river."
},
{
"partOfSpeech": "n.",
"text": "An injury caused by jamming."
},
{
"partOfSpeech": "n.",
"text": "A preserve of fruit boiled with sugar and water; as, raspberry jam; currant jam; grape jam."
}
],
"jammed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jam"
}
],
"jamming": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jam"
}
],
"jamacina": [
{
"partOfSpeech": "n.",
"text": "Jamaicine."
}
],
"jamadar": [
{
"partOfSpeech": "n.",
"text": "Same as Jemidar."
}
],
"jamaica": [
{
"partOfSpeech": "n.",
"text": "One of the West India is islands."
}
],
"jamaican": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Jamaica."
},
{
"partOfSpeech": "n.",
"text": "A native or inhabitant of Jamaica."
}
],
"jamaicine": [
{
"partOfSpeech": "n.",
"text": "An alkaloid said to be contained in the bark of Geoffroya inermis, a leguminous tree growing in Jamaica and Surinam; -- called also jamacina."
}
],
"jamb": [
{
"partOfSpeech": "n.",
"text": "The vertical side of any opening, as a door or fireplace; hence, less properly, any narrow vertical surface of wall, as the of a chimney-breast or of a pier, as distinguished from its face."
},
{
"partOfSpeech": "n.",
"text": "Any thick mass of rock which prevents miners from following the lode or vein."
},
{
"partOfSpeech": "v. t.",
"text": "See Jam, v. t."
}
],
"jambee": [
{
"partOfSpeech": "n.",
"text": "A fashionable cane."
}
],
"jambes": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jambeux"
}
],
"jambeux": [
{
"partOfSpeech": "n.",
"text": "In the Middle Ages, armor for the legs below the knees."
}
],
"jambolana": [
{
"partOfSpeech": "n.",
"text": "A myrtaceous tree of the West Indies and tropical AmericaCalyptranthes Jambolana), with astringent bark, used for dyeing. It bears an edible fruit."
}
],
"jamdani": [
{
"partOfSpeech": "n.",
"text": "A silk fabric, with a woven pattern of sprigs of flowers."
}
],
"jamesonite": [
{
"partOfSpeech": "n.",
"text": "A steel-gray mineral, of metallic luster, commonly fibrous massive. It is a sulphide of antimony and lead, with a little iron."
}
],
"james's powder": [
{
"partOfSpeech": "",
"text": "Antimonial powder, first prepared by Dr. James, ar English physician; -- called also fever powder."
}
],
"jamestown weed": [
{
"partOfSpeech": "",
"text": "The poisonous thorn apple or stramoniumDatura stramonium), a rank weed early noticed at Jamestown, Virginia. See Datura."
}
],
"jan": [
{
"partOfSpeech": "n.",
"text": "One of intermediate order between angels and men."
}
],
"jane": [
{
"partOfSpeech": "n.",
"text": "A coin of Genoa; any small coin."
},
{
"partOfSpeech": "n.",
"text": "A kind of twilled cotton cloth. See Jean."
}
],
"jane-of-apes": [
{
"partOfSpeech": "n.",
"text": "A silly, pert girl; -- corresponding to jackanapes."
}
],
"jangled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jangle"
}
],
"jangling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jangle"
},
{
"partOfSpeech": "a.",
"text": "Producing discordant sounds."
},
{
"partOfSpeech": "n.",
"text": "Idle babbling; vain disputation."
},
{
"partOfSpeech": "n.",
"text": "Wrangling; altercation."
}
],
"jangle": [
{
"partOfSpeech": "v. i.",
"text": "To sound harshly or discordantly, as bells out of tune."
},
{
"partOfSpeech": "v. i.",
"text": "To talk idly; to prate; to babble; to chatter; to gossip."
},
{
"partOfSpeech": "v. i.",
"text": "To quarrel in words; to altercate; to wrangle."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to sound harshly or inharmoniously; to produce discordant sounds with."
},
{
"partOfSpeech": "n.",
"text": "Idle talk; prate; chatter; babble."
},
{
"partOfSpeech": "n.",
"text": "Discordant sound; wrangling."
}
],
"jangler": [
{
"partOfSpeech": "n.",
"text": "An idle talker; a babbler; a prater."
},
{
"partOfSpeech": "n.",
"text": "A wrangling, noisy fellow."
}
],
"jangleress": [
{
"partOfSpeech": "n.",
"text": "A female prater or babbler."
}
],
"janglery": [
{
"partOfSpeech": "n.",
"text": "Jangling."
}
],
"janissary": [
{
"partOfSpeech": "n.",
"text": "See Janizary."
}
],
"janitor": [
{
"partOfSpeech": "n.",
"text": "A door-keeper; a porter; one who has the care of a public building, or a building occupied for offices, suites of rooms, etc."
}
],
"janitress": [
{
"partOfSpeech": "n.",
"text": "Alt. of Janitrix"
}
],
"janitrix": [
{
"partOfSpeech": "n.",
"text": "A female janitor."
}
],
"janizar": [
{
"partOfSpeech": "n.",
"text": "A janizary."
}
],
"janizarian": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the janizaries, or their government."
}
],
"janizaries": [
{
"partOfSpeech": "pl. ",
"text": "of Janizary"
}
],
"janizary": [
{
"partOfSpeech": "n.",
"text": "A soldier of a privileged military class, which formed the nucleus of the Turkish infantry, but was suppressed in 1826."
}
],
"janker": [
{
"partOfSpeech": "n.",
"text": "A long pole on two wheels, used in hauling logs."
}
],
"jansenism": [
{
"partOfSpeech": "n.",
"text": "The doctrine of Jansen regarding free will and divine grace."
}
],
"jansenist": [
{
"partOfSpeech": "n.",
"text": "A follower of Cornelius Jansen, a Roman Catholic bishop of Ypres, in Flanders, in the 17th century, who taught certain doctrines denying free will and the possibility of resisting divine grace."
}
],
"jant": [
{
"partOfSpeech": "v. i.",
"text": "See Jaunt."
}
],
"janthina": [
{
"partOfSpeech": "n.",
"text": "See Ianthina."
}
],
"jantily": [
{
"partOfSpeech": "adv.",
"text": "See Jauntily."
}
],
"jantiness": [
{
"partOfSpeech": "n.",
"text": "See Jauntiness."
}
],
"jantu": [
{
"partOfSpeech": "n.",
"text": "A machine of great antiquity, used in Bengal for raising water to irrigate land."
}
],
"janty": [
{
"partOfSpeech": "a.",
"text": "See Jaunty."
}
],
"january": [
{
"partOfSpeech": "n.",
"text": "The first month of the year, containing thirty-one days."
}
],
"janus": [
{
"partOfSpeech": "n.",
"text": "A Latin deity represented with two faces looking in opposite directions. Numa is said to have dedicated to Janus the covered passage at Rome, near the Forum, which is usually called the Temple of Janus. This passage was open in war and closed in peace."
}
],
"janus-faced": [
{
"partOfSpeech": "a.",
"text": "Double-faced; deceitful."
}
],
"janus-headed": [
{
"partOfSpeech": "a.",
"text": "Double-headed."
}
],
"japan": [
{
"partOfSpeech": "n.",
"text": "Work varnished and figured in the Japanese manner; also, the varnish or lacquer used in japanning."
},
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Japan, or to the lacquered work of that country; as, Japan ware."
},
{
"partOfSpeech": "v. t.",
"text": "To cover with a coat of hard, brilliant varnish, in the manner of the Japanese; to lacquer."
},
{
"partOfSpeech": "v. t.",
"text": "To give a glossy black to, as shoes."
}
],
"japanned": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Japan"
},
{
"partOfSpeech": "a.",
"text": "Treated, or coated, with varnish in the Japanese manner."
}
],
"japanning": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Japan"
},
{
"partOfSpeech": "n.",
"text": "The art or act of varnishing in  the Japanese manner."
}
],
"japanese": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Japan, or its inhabitants."
},
{
"partOfSpeech": "n. sing. & pl.",
"text": "A native or inhabitant of Japan; collectively, the people of Japan."
},
{
"partOfSpeech": "n. sing. & pl.",
"text": "The language of the people of Japan."
}
],
"japanner": [
{
"partOfSpeech": "n.",
"text": "One who varnishes in the manner of the Japanese, or one skilled in the art."
},
{
"partOfSpeech": "n.",
"text": "A bootblack."
}
],
"japannish": [
{
"partOfSpeech": "a.",
"text": "After the manner of the Japanese; resembling japanned articles."
}
],
"jape": [
{
"partOfSpeech": "v. i.",
"text": "To jest; to play tricks; to jeer."
},
{
"partOfSpeech": "v. t.",
"text": "To mock; to trick."
}
],
"japer": [
{
"partOfSpeech": "n.",
"text": "A jester; a buffoon."
}
],
"japery": [
{
"partOfSpeech": "n.",
"text": "Jesting; buffoonery."
}
],
"japhethite": [
{
"partOfSpeech": "n.",
"text": "A Japhetite."
}
],
"japhetic": [
{
"partOfSpeech": "a.",
"text": "Pertaining to, or derived from, Japheth, one of the sons of Noah; as, Japhetic nations, the nations of Europe and Northern Asia; Japhetic languages."
}
],
"japhetite": [
{
"partOfSpeech": "n.",
"text": "A descendant of Japheth."
}
],
"japonica": [
{
"partOfSpeech": "n.",
"text": "A species of CamelliaCamellia Japonica), a native of Japan, bearing beautiful red or white flowers. Many other genera have species of the same name."
}
],
"jar": [
{
"partOfSpeech": "n.",
"text": "A turn. [Only in phrase.]"
},
{
"partOfSpeech": "n.",
"text": "A deep, broad-mouthed vessel of earthenware or glass, for holding fruit, preserves, etc., or for ornamental purposes; as, a jar of honey; a rose jar."
},
{
"partOfSpeech": "n.",
"text": "The measure of what is contained in a jar; as, a jar of oil; a jar of preserves."
},
{
"partOfSpeech": "v. i.",
"text": "To  give forth a rudely quivering or tremulous sound; to sound harshly or discordantly; as, the notes jarred on my ears."
},
{
"partOfSpeech": "v. i.",
"text": "To act in opposition or disagreement; to clash; to interfere; to quarrel; to dispute."
},
{
"partOfSpeech": "v. t.",
"text": "To cause a short, tremulous motion of, to cause to tremble, as by a sudden shock or blow; to shake; to shock; as, to jar the earth; to jar one's faith."
},
{
"partOfSpeech": "v. t.",
"text": "To tick; to beat; to mark or tell off."
},
{
"partOfSpeech": "n.",
"text": "A rattling, tremulous vibration or shock; a shake; a harsh sound; a discord; as, the jar of a train; the jar of harsh sounds."
},
{
"partOfSpeech": "n.",
"text": "Clash of interest or opinions; collision; discord; debate; slight disagreement."
},
{
"partOfSpeech": "n.",
"text": "A regular vibration, as of a pendulum."
},
{
"partOfSpeech": "n.",
"text": "In deep well boring, a device resembling two long chain links, for connecting a percussion drill to the rod or rope which works it, so that the drill is driven down by impact and is jerked loose when jammed."
}
],
"jarred": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jar"
}
],
"jarring": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jar"
},
{
"partOfSpeech": "a.",
"text": "Shaking; disturbing; discordant."
},
{
"partOfSpeech": "n.",
"text": "A shaking; a tremulous motion; as, the jarring of a steamship, caused by its engines."
},
{
"partOfSpeech": "n.",
"text": "Discord; a clashing of interests."
}
],
"jararaca": [
{
"partOfSpeech": "n.",
"text": "A poisonous serpent of BrazilBothrops jararaca), about eighteen inches long, and of a dusky, brownish color, variegated with red and black spots."
}
],
"jarble": [
{
"partOfSpeech": "v. t.",
"text": "To wet; to bemire."
}
],
"jardiniere": [
{
"partOfSpeech": "n.",
"text": "An ornamental stand or receptacle for plants, flowers, etc., used as a piece of decorative furniture in room."
},
{
"partOfSpeech": "n.",
"text": "A preparation of mixed vegetables stewed in a sauce with savory herbs, etc.; also, a soup made in this way."
}
],
"jards": [
{
"partOfSpeech": "n.",
"text": "A callous tumor on the leg of a horse, below the hock."
}
],
"jargle": [
{
"partOfSpeech": "v. i.",
"text": "To emit a harsh or discordant sound."
}
],
"jargon": [
{
"partOfSpeech": "n.",
"text": "Confused, unintelligible language; gibberish; hence, an artificial idiom or dialect; cant language; slang."
},
{
"partOfSpeech": "v. i.",
"text": "To utter jargon; to emit confused or unintelligible sounds; to talk unintelligibly, or in a harsh and noisy manner."
},
{
"partOfSpeech": "n.",
"text": "A variety of zircon. See Zircon."
}
],
"jargoned": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jargon"
}
],
"jargoning": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jargon"
}
],
"jargonelle": [
{
"partOfSpeech": "n.",
"text": "A variety of pear which ripens early."
}
],
"jargonic": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the mineral jargon."
}
],
"jargonist": [
{
"partOfSpeech": "n.",
"text": "One addicted to jargon; one who uses cant or slang."
}
],
"jarl": [
{
"partOfSpeech": "n.",
"text": "A chief; an earl; in English history, one of the leaders in the Danish and Norse invasions."
}
],
"jarnut": [
{
"partOfSpeech": "n.",
"text": "An earthnut."
}
],
"jarosite": [
{
"partOfSpeech": "n.",
"text": "An ocher-yellow mineral occurring on minute rhombohedral crystals. It is a hydrous sulphate of iron and potash."
}
],
"jar-owl": [
{
"partOfSpeech": "n.",
"text": "The goatsucker."
}
],
"jarrah": [
{
"partOfSpeech": "n.",
"text": "The mahoganylike wood of the Australian Eucalyptus marginata. See Eucalyptus."
}
],
"jarringly": [
{
"partOfSpeech": "adv.",
"text": "In a jarring or discordant manner."
}
],
"jarvey": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jarvy"
}
],
"jarvy": [
{
"partOfSpeech": "n.",
"text": "The driver of a hackney coach."
},
{
"partOfSpeech": "n.",
"text": "A hackney coach."
}
],
"jasey": [
{
"partOfSpeech": "n.",
"text": "A wig; -- so called, perhaps, from being made of, or resembling, Jersey yarn."
}
],
"jashawk": [
{
"partOfSpeech": "n.",
"text": "A young hawk."
}
],
"jasmine": [
{
"partOfSpeech": "n.",
"text": "A shrubby plant of the genus Jasminum, bearing flowers of a peculiarly fragrant odor. The J. officinale, common in the south of Europe, bears white flowers. The Arabian jasmine is J. Sambac, and, with J. angustifolia, comes from the East Indies. The yellow false jasmine in the Gelseminum sempervirenssee Gelsemium). Several other plants are called jasmine in the West Indies, as species of Calotropis and Faramea."
}
],
"jasp": [
{
"partOfSpeech": "n.",
"text": "Jasper."
}
],
"jaspachate": [
{
"partOfSpeech": "n.",
"text": "Agate jasper."
}
],
"jasper": [
{
"partOfSpeech": "n.",
"text": "An opaque, impure variety of quartz, of red, yellow, and other dull colors, breaking with a smooth surface. It admits of a high polish, and is used for vases, seals, snuff boxes, etc. When the colors are in stripes or bands, it is called striped /  banded jasper. The Egyptian pebble is a brownish yellow jasper."
}
],
"jasperated": [
{
"partOfSpeech": "a.",
"text": "mixed with jasper; containing particles of jasper; as, jasperated agate."
}
],
"jasperize": [
{
"partOfSpeech": "v. t.",
"text": "To convert into, or make to resemble, jasper."
}
],
"jaspery": [
{
"partOfSpeech": "a.",
"text": "Of the nature of jasper; mixed with jasper."
}
],
"jaspidean": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jaspideous"
}
],
"jaspideous": [
{
"partOfSpeech": "a.",
"text": "Consisting of jasper, or containing jasper; jaspery; jasperlike."
}
],
"jaspilite": [
{
"partOfSpeech": "n.",
"text": "A compact siliceous rock resembling jasper."
}
],
"jaspoid": [
{
"partOfSpeech": "a.",
"text": "Resembling jasper."
}
],
"jasponyx": [
{
"partOfSpeech": "n.",
"text": "An onyx, part or all of whose layers consist of jasper."
}
],
"jatrophic": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to physic nuts, the seeds of plants of the genus Jatropha."
}
],
"jaunce": [
{
"partOfSpeech": "v. i.",
"text": "To ride hard; to jounce."
}
],
"jaundice": [
{
"partOfSpeech": "n.",
"text": "A morbid condition, characterized by yellowness of the eyes, skin, and urine, whiteness of the faeces, constipation, uneasiness in the region of the stomach, loss of appetite, and general languor and lassitude. It is caused usually by obstruction of the biliary passages and consequent damming up, in the liver, of the bile, which is then absorbed into the blood."
},
{
"partOfSpeech": "v. t.",
"text": "To affect with jaundice; to color by prejudice or envy; to prejudice."
}
],
"jaundiced": [
{
"partOfSpeech": "a.",
"text": "Affected with jaundice."
},
{
"partOfSpeech": "a.",
"text": "Prejudiced; envious; as, a jaundiced judgment."
}
],
"jaunted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jaunt"
}
],
"jaunting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jaunt"
}
],
"jaunt": [
{
"partOfSpeech": "v. i.",
"text": "To ramble here and there; to stroll; to make an excursion."
},
{
"partOfSpeech": "v. i.",
"text": "To ride on a jaunting car."
},
{
"partOfSpeech": "v. t.",
"text": "To jolt; to jounce."
},
{
"partOfSpeech": "n.",
"text": "A wearisome journey."
},
{
"partOfSpeech": "n.",
"text": "A short excursion for pleasure or refreshment; a ramble; a short journey."
}
],
"jauntily": [
{
"partOfSpeech": "adv.",
"text": "In a jaunty manner."
}
],
"jauntiness": [
{
"partOfSpeech": "n.",
"text": "The quality of being jaunty."
}
],
"jaunty": [
{
"partOfSpeech": "superl.",
"text": "Airy; showy; finical; hence, characterized by an affected or fantastical manner."
}
],
"java": [
{
"partOfSpeech": "n.",
"text": "One of the islands of the Malay Archipelago belonging to the Netherlands."
},
{
"partOfSpeech": "n.",
"text": "Java coffee, a kind of coffee brought from Java."
}
],
"javanese": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Java, or to the people of Java."
},
{
"partOfSpeech": "n. sing. & pl.",
"text": "A native or natives of Java."
}
],
"javel": [
{
"partOfSpeech": "n.",
"text": "A vagabond."
}
],
"javelin": [
{
"partOfSpeech": "n.",
"text": "A sort of light spear, to be thrown or cast by thew hand; anciently, a weapon of war used by horsemen and foot soldiers; now used chiefly in hunting the wild boar and other fierce game."
},
{
"partOfSpeech": "v. t.",
"text": "To pierce with a javelin."
}
],
"javelinier": [
{
"partOfSpeech": "n.",
"text": "A soldier armed with a javelin."
}
],
"jaw": [
{
"partOfSpeech": "n.",
"text": "One of the bones, usually bearing teeth, which form the framework of the mouth."
},
{
"partOfSpeech": "n.",
"text": "Hence, also, the bone itself with the teeth and covering."
},
{
"partOfSpeech": "n.",
"text": "In the plural, the mouth."
},
{
"partOfSpeech": "n.",
"text": "Fig.: Anything resembling the jaw of an animal in form or action; esp., pl., the mouth or way of entrance; as, the jaws of a pass; the jaws of darkness; the jaws of death."
},
{
"partOfSpeech": "n.",
"text": "A notch or opening."
},
{
"partOfSpeech": "n.",
"text": "A notched or forked part, adapted for holding an object in place; as, the jaw of a railway-car pedestal. See Axle guard."
},
{
"partOfSpeech": "n.",
"text": "One of a pair of opposing parts which are movable towards or from each other, for grasping or crushing anything between them, as, the jaws of a vise, or the jaws of a stone-crushing machine."
},
{
"partOfSpeech": "n.",
"text": "The inner end of a boom or gaff, hollowed in a half circle so as to move freely on a mast."
},
{
"partOfSpeech": "n.",
"text": "Impudent or abusive talk."
},
{
"partOfSpeech": "v. i.",
"text": "To scold; to clamor."
},
{
"partOfSpeech": "v. t.",
"text": "To assail or abuse by scolding."
}
],
"jawed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jaw"
},
{
"partOfSpeech": "a.",
"text": "Having jaws; -- chiefly in composition; as, lantern-jawed."
}
],
"jawing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jaw"
},
{
"partOfSpeech": "n.",
"text": "Scolding; clamorous or abusive talk."
}
],
"jawbone": [
{
"partOfSpeech": "n.",
"text": "The bone of either jaw; a maxilla or a mandible."
}
],
"law-fall": [
{
"partOfSpeech": "n.",
"text": "Depression of the jaw; hence, depression of spirits."
}
],
"jaw-fallen": [
{
"partOfSpeech": "a.",
"text": "Dejected; chopfallen."
}
],
"jawfoot": [
{
"partOfSpeech": "n.",
"text": "See Maxilliped."
}
],
"jawn": [
{
"partOfSpeech": "v. i.",
"text": "See Yawn."
}
],
"jawy": [
{
"partOfSpeech": "a.",
"text": "Relating to the jaws."
}
],
"jay": [
{
"partOfSpeech": "n.",
"text": "Any one of the numerous species of birds belonging to Garrulus, Cyanocitta, and allied genera. They are allied to the crows, but are smaller, more graceful in form, often handsomely colored, and usually have a crest."
}
],
"jayet": [
{
"partOfSpeech": "n.",
"text": "See Jet."
}
],
"jayhawker": [
{
"partOfSpeech": "n.",
"text": "A name given to a free-booting, unenlisted, armed man or guerrilla."
}
],
"jazel": [
{
"partOfSpeech": "n.",
"text": "A gem of an azure color."
}
],
"jazerant": [
{
"partOfSpeech": "n.",
"text": "A coat of defense made of small plates of metal sewed upon linen or the like; also, this kind of armor taken generally; as, a coat of jazerant."
}
],
"jealous": [
{
"partOfSpeech": "a.",
"text": "Zealous; solicitous; vigilant; anxiously watchful."
},
{
"partOfSpeech": "a.",
"text": "Apprehensive; anxious; suspiciously watchful."
},
{
"partOfSpeech": "a.",
"text": "Exacting exclusive devotion; intolerant of rivalry."
},
{
"partOfSpeech": "a.",
"text": "Disposed to suspect rivalry in matters of interest and affection; apprehensive regarding the motives of possible rivals, or the fidelity of friends; distrustful; having morbid fear of rivalry in love or preference given to another; painfully suspicious of the faithfulness of husband, wife, or lover."
}
],
"jealoushood": [
{
"partOfSpeech": "n.",
"text": "Jealousy."
}
],
"jealously": [
{
"partOfSpeech": "adv.",
"text": "In a jealous manner."
}
],
"jealousness": [
{
"partOfSpeech": "n.",
"text": "State or quality of being jealous."
}
],
"jealousies": [
{
"partOfSpeech": "pl. ",
"text": "of Jealousy"
}
],
"jealousy": [
{
"partOfSpeech": "n.",
"text": "The quality of being jealous; earnest concern or solicitude; painful apprehension of rivalship in cases nearly affecting one's happiness; painful suspicion of the faithfulness of husband, wife, or lover."
}
],
"jeames": [
{
"partOfSpeech": "n.",
"text": "A footman; a flunky."
}
],
"jean": [
{
"partOfSpeech": "n.",
"text": "A twilled cotton cloth."
}
],
"jears": [
{
"partOfSpeech": "n. pl.",
"text": "See 1st Jeerb)."
}
],
"jeat": [
{
"partOfSpeech": "n.",
"text": "See Jet."
}
],
"jedding ax": [
{
"partOfSpeech": "n.",
"text": "A stone mason's tool, having a flat face and a pointed part."
}
],
"jee": [
{
"partOfSpeech": "v. t. & i.",
"text": "See Gee."
}
],
"jeel": [
{
"partOfSpeech": "n.",
"text": "A morass; a shallow lake."
}
],
"jeer": [
{
"partOfSpeech": "n.",
"text": "A gear; a tackle."
},
{
"partOfSpeech": "n.",
"text": "An assemblage or combination of tackles, for hoisting or lowering the lower yards of a ship."
},
{
"partOfSpeech": "v.",
"text": "To utter sarcastic or scoffing reflections; to speak with mockery or derision; to use taunting language; to scoff; as, to jeer at a speaker."
},
{
"partOfSpeech": "v. t.",
"text": "To treat with scoffs or derision; to address with jeers; to taunt; to flout; to mock at."
},
{
"partOfSpeech": "n.",
"text": "A railing remark or reflection; a scoff; a taunt; a biting jest; a flout; a jibe; mockery."
}
],
"jeered": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jeer"
}
],
"jeering": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jeer"
},
{
"partOfSpeech": "a.",
"text": "Mocking; scoffing."
},
{
"partOfSpeech": "n.",
"text": "A mocking utterance."
}
],
"jeerer": [
{
"partOfSpeech": "n.",
"text": "A scoffer; a railer; a mocker."
}
],
"jeers": [
{
"partOfSpeech": "n. pl.",
"text": "See 1st Jeerb)."
}
],
"jeffersonia": [
{
"partOfSpeech": "n.",
"text": "An American herb with a pretty, white, solitary blossom, and deeply two-cleft leavesJeffersonia diphylla); twinleaf."
}
],
"jeffersonian": [
{
"partOfSpeech": "a.",
"text": "Pertaining to, or characteristic of, Thomas Jefferson or his policy or political doctrines."
},
{
"partOfSpeech": "a.",
"text": "Pert. to, or characteristic of, Thomas Jeffersonthird President of the United States) or his political doctrines, which were those of the Republicanism of his time, as opposed to those of the Federalists."
},
{
"partOfSpeech": "n.",
"text": "An adherent of Jefferson or his doctrines."
}
],
"jeffersonite": [
{
"partOfSpeech": "n.",
"text": "A variety of pyroxene of olive-green color passing into brown. It contains zinc."
}
],
"jeg": [
{
"partOfSpeech": "n.",
"text": "See Jig, 6."
}
],
"jehovah": [
{
"partOfSpeech": "n.",
"text": "A Scripture name of the Supreme Being, by which he was revealed to the Jews as their covenant God or Sovereign of the theocracy; the \"ineffable name\" of the Supreme Being, which was not pronounced by the Jews."
}
],
"jehovist": [
{
"partOfSpeech": "n.",
"text": "One who maintains that the vowel points of the word Jehovah, in Hebrew, are the proper vowels of that word; -- opposed to adonist."
},
{
"partOfSpeech": "n.",
"text": "The writer of the passages of the Old Testament, especially those of the Pentateuch, in which the Supreme Being is styled Jehovah. See Elohist."
},
{
"partOfSpeech": "",
"text": "The author of the passages of the Old Testament, esp. those of the Hexateuch, in which God is styled Yahweh, or Jehovah; the author of the Yahwistic, or Jehovistic, Prophetic DocumentJ); also, the document itself."
}
],
"jehovistic": [
{
"partOfSpeech": "a.",
"text": "Relating to, or containing, Jehovah, as a name of God; -- said of certain parts of the Old Testament, especially of the Pentateuch, in which Jehovah appears as the name of the Deity. See Elohistic."
}
],
"jehu": [
{
"partOfSpeech": "n.",
"text": "A coachman; a driver; especially, one who drives furiously."
}
],
"jejunal": [
{
"partOfSpeech": "a.",
"text": "Pertaining to the jejunum."
}
],
"jejune": [
{
"partOfSpeech": "a.",
"text": "Lacking matter; empty; void of substance."
},
{
"partOfSpeech": "a.",
"text": "Void of interest; barren; meager; dry; as, a jejune narrative."
}
],
"jejunity": [
{
"partOfSpeech": "n.",
"text": "The quality of being jejune; jejuneness."
}
],
"jejunum": [
{
"partOfSpeech": "n.",
"text": "The middle division of the small intestine, between the duodenum and ileum; -- so called because usually found empty after death."
}
],
"jelerang": [
{
"partOfSpeech": "n.",
"text": "A large, handsome squirrelSciurus Javensis), native of Java and Southern Asia; -- called also Java squirrel."
}
],
"jell": [
{
"partOfSpeech": "v. i.",
"text": "To jelly."
}
],
"jellied": [
{
"partOfSpeech": "a.",
"text": "Brought to the state or consistence of jelly."
},
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jelly"
}
],
"jellies": [
{
"partOfSpeech": "pl. ",
"text": "of Jelly"
}
],
"jelly": [
{
"partOfSpeech": "n.",
"text": "Anything brought to a gelatinous condition; a viscous, translucent substance in a condition between liquid and solid; a stiffened solution of gelatin, gum, or the like."
},
{
"partOfSpeech": "n.",
"text": "The juice of fruits or meats boiled with sugar to an elastic consistence; as, currant jelly; calf's-foot jelly."
},
{
"partOfSpeech": "v. i.",
"text": "To become jelly; to come to the state or consistency of jelly."
}
],
"jellying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jelly"
}
],
"jellyfish": [
{
"partOfSpeech": "n.",
"text": "Any one of the acalephs, esp. one of the larger species, having a jellylike appearance. See Medusa."
}
],
"jemidar": [
{
"partOfSpeech": "n.",
"text": "The chief or leader of a hand or body of persons; esp., in the native army of India, an officer of a rank corresponding to that of lieutenant in the English army."
}
],
"jemlah goat": [
{
"partOfSpeech": "",
"text": "The jharal."
}
],
"jemminess": [
{
"partOfSpeech": "n.",
"text": "Spruceness."
}
],
"jemmy": [
{
"partOfSpeech": "a.",
"text": "Spruce."
},
{
"partOfSpeech": "n.",
"text": "A short crowbar. See Jimmy."
},
{
"partOfSpeech": "n.",
"text": "A baked sheep's head."
}
],
"jeniquen": [
{
"partOfSpeech": "n.",
"text": "A Mexican name for the Sisal hempAgave rigida, var. Sisalana); also, its fiber."
}
],
"jenite": [
{
"partOfSpeech": "n.",
"text": "See Yenite."
}
],
"jenkins": [
{
"partOfSpeech": "n.",
"text": "name of contempt for a flatterer of persons high in social or official life; as, the Jenkins employed by a newspaper."
}
],
"jennet": [
{
"partOfSpeech": "n.",
"text": "A small Spanish horse; a genet."
}
],
"jenneting": [
{
"partOfSpeech": "n.",
"text": "A variety of early apple. See Juneating."
}
],
"jennies": [
{
"partOfSpeech": "pl. ",
"text": "of Jenny"
}
],
"jenny": [
{
"partOfSpeech": "n.",
"text": "A familiar or pet form of the proper name Jane."
},
{
"partOfSpeech": "n.",
"text": "A familiar name of the European wren."
},
{
"partOfSpeech": "n.",
"text": "A machine for spinning a number of threads at once, -- used in factories."
}
],
"jentling": [
{
"partOfSpeech": "n.",
"text": "A fish of the genus Leuciscus; the blue chub of the Danube."
}
],
"jeofail": [
{
"partOfSpeech": "n.",
"text": "An oversight in pleading, or the acknowledgment of a mistake or oversight."
}
],
"jeoparded": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jeopard"
}
],
"jeoparding": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jeopard"
}
],
"jeopard": [
{
"partOfSpeech": "v. t.",
"text": "To put in jeopardy; to expose to loss or injury; to imperil; to hazard."
}
],
"jeoparder": [
{
"partOfSpeech": "n.",
"text": "One who puts in jeopardy."
}
],
"jeopardized": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jeopardize"
}
],
"jeopardizing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jeopardize"
}
],
"jeopardize": [
{
"partOfSpeech": "v. t.",
"text": "To expose to loss or injury; to risk; to jeopard."
}
],
"jeopardous": [
{
"partOfSpeech": "a.",
"text": "Perilous; hazardous."
}
],
"jeopardy": [
{
"partOfSpeech": "n.",
"text": "Exposure to death, loss, or injury; hazard; danger."
},
{
"partOfSpeech": "v. t.",
"text": "To jeopardize."
}
],
"jerboa": [
{
"partOfSpeech": "n.",
"text": "Any small jumping rodent of the genus Dipus, esp. D. Aegyptius, which is common in Egypt and the adjacent countries. The jerboas have very long hind legs and a long tail."
}
],
"jereed": [
{
"partOfSpeech": "n.",
"text": "A blunt javelin used by the people of the Levant, especially in mock fights."
}
],
"jeremiad": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jeremiade"
}
],
"jeremiade": [
{
"partOfSpeech": "n.",
"text": "A tale of sorrow, disappointment, or complaint; a doleful story; a dolorous tirade; -- generally used satirically."
}
],
"jerfalcon": [
{
"partOfSpeech": "n.",
"text": "The gyrfalcon."
}
],
"jerguer": [
{
"partOfSpeech": "n.",
"text": "See Jerquer."
}
],
"jerid": [
{
"partOfSpeech": "n.",
"text": "Same as Jereed."
}
],
"jerk": [
{
"partOfSpeech": "v. t.",
"text": "To cut into long slices or strips and dry in the sun; as, jerk beef. See Charqui."
},
{
"partOfSpeech": "v. t.",
"text": "To beat; to strike."
},
{
"partOfSpeech": "v. t.",
"text": "To give a quick and suddenly arrested thrust, push, pull, or twist, to; to yerk; as, to jerk one with the elbow; to jerk a coat off."
},
{
"partOfSpeech": "v. t.",
"text": "To throw with a quick and suddenly arrested motion of the hand; as, to jerk a stone."
},
{
"partOfSpeech": "v. i.",
"text": "To make a sudden motion; to move with a start, or by starts."
},
{
"partOfSpeech": "v. i.",
"text": "To flout with contempt."
},
{
"partOfSpeech": "n.",
"text": "A short, sudden pull, thrust, push, twitch, jolt, shake, or similar motion."
},
{
"partOfSpeech": "n.",
"text": "A sudden start or spring."
}
],
"jerked": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jerk"
}
],
"jerking": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jerk"
},
{
"partOfSpeech": "n.",
"text": "The act of pulling, pushing, or throwing, with a jerk."
}
],
"jerker": [
{
"partOfSpeech": "n.",
"text": "A beater."
},
{
"partOfSpeech": "n.",
"text": "One who jerks or moves with a jerk."
},
{
"partOfSpeech": "n.",
"text": "A North American river chubHybopsis biguttatus)."
}
],
"jerkin": [
{
"partOfSpeech": "n.",
"text": "A jacket or short coat; a close waistcoat."
},
{
"partOfSpeech": "n.",
"text": "A male gyrfalcon."
}
],
"jerkinhead": [
{
"partOfSpeech": "n.",
"text": "The hipped part of a roof which is hipped only for a part of its height, leaving a truncated gable."
}
],
"jerky": [
{
"partOfSpeech": "a.",
"text": "Moving by jerks and starts; characterized by abrupt transitions; as, a jerky vehicle; a jerky style."
}
],
"jermoonal": [
{
"partOfSpeech": "n.",
"text": "The Himalayan now partridge."
}
],
"jeronymite": [
{
"partOfSpeech": "n.",
"text": "One belonging of the mediaeval religious orders called Hermits of St. Jerome."
}
],
"jeropigia": [
{
"partOfSpeech": "n.",
"text": "See Geropigia."
}
],
"jerquer": [
{
"partOfSpeech": "n.",
"text": "A customhouse officer who searches ships for unentered goods."
}
],
"jerquing": [
{
"partOfSpeech": "n.",
"text": "The searching of a ship for unentered goods."
},
{
"partOfSpeech": "n.",
"text": "The searching of a ship for unentered goods."
}
],
"jerry-built": [
{
"partOfSpeech": "a.",
"text": "Built hastily and of bad materials; as, jerry-built houses."
}
],
"jerseys": [
{
"partOfSpeech": "pl. ",
"text": "of Jersey"
}
],
"jersey": [
{
"partOfSpeech": "n.",
"text": "The finest of wool separated from the rest; combed wool; also, fine yarn of wool."
},
{
"partOfSpeech": "n.",
"text": "A kind of knitted jacket; hence, in general, a closefitting jacket or upper garment made of an elastic fabricas stockinet)."
},
{
"partOfSpeech": "n.",
"text": "One of a breed of cattle in the Island of Jersey. Jerseys are noted for the richness of their milk."
}
],
"jerusalem": [
{
"partOfSpeech": "n.",
"text": "The chief city of Palestine, intimately associated with the glory of the Jewish nation, and the life and death of Jesus Christ."
}
],
"jervine": [
{
"partOfSpeech": "n.",
"text": "A poisonous alkaloid resembling veratrine, and found with it in white helleboreVeratrum album); -- called also jervina."
}
],
"jesses": [
{
"partOfSpeech": "pl. ",
"text": "of Jess"
}
],
"jess": [
{
"partOfSpeech": "n.",
"text": "A short strap of leather or silk secured round the leg of a hawk, to which the leash or line, wrapped round the falconer's hand, was attached when used. See Illust. of Falcon."
}
],
"jessamine": [
{
"partOfSpeech": "n.",
"text": "Same as Jasmine."
}
],
"jessant": [
{
"partOfSpeech": "a.",
"text": "Springing up or emerging; -- said of a plant or animal."
}
],
"jesse": [
{
"partOfSpeech": "n.",
"text": "Any representation or suggestion of the genealogy of Christ, in decorative art"
},
{
"partOfSpeech": "n.",
"text": "A genealogical tree represented in stained glass."
},
{
"partOfSpeech": "n.",
"text": "A candlestick with many branches, each of which bears the name of some one of the descendants of Jesse; -- called also  tree of Jesse."
}
],
"jessed": [
{
"partOfSpeech": "a.",
"text": "Having jesses on, as a hawk."
}
],
"jest": [
{
"partOfSpeech": "n.",
"text": "A deed; an action; a gest."
},
{
"partOfSpeech": "n.",
"text": "A mask; a pageant; an interlude."
},
{
"partOfSpeech": "n.",
"text": "Something done or said in order to amuse; a joke; a witticism; a jocose or sportive remark or phrase. See Synonyms under Jest, v. i."
},
{
"partOfSpeech": "v. i.",
"text": "The object of laughter or sport; a laughingstock."
},
{
"partOfSpeech": "v. i.",
"text": "To take part in a merrymaking; -- especially, to act in a mask or interlude."
},
{
"partOfSpeech": "v. i.",
"text": "To make merriment by words or actions; to joke; to make light of anything."
}
],
"jested": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jest"
}
],
"jesting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jest"
},
{
"partOfSpeech": "a.",
"text": "Sportive; not serious; fit for jests."
},
{
"partOfSpeech": "n.",
"text": "The act or practice of making jests; joking; pleasantry."
}
],
"jester": [
{
"partOfSpeech": "n.",
"text": "A buffoon; a merry-andrew; a court fool."
},
{
"partOfSpeech": "n.",
"text": "A person addicted to jesting, or to indulgence in light and amusing talk."
}
],
"jestful": [
{
"partOfSpeech": "a.",
"text": "Given to jesting; full of jokes."
}
],
"jestingly": [
{
"partOfSpeech": "adv.",
"text": "In a jesting manner."
}
],
"jesuit": [
{
"partOfSpeech": "n.",
"text": "One of a religious order founded by Ignatius Loyola, and approved in 1540, under the title of The Society of Jesus."
},
{
"partOfSpeech": "n.",
"text": "Fig.: A crafty person; an intriguer."
}
],
"jesuited": [
{
"partOfSpeech": "a.",
"text": "Conforming to the principles of the Jesuits."
}
],
"jesuitess": [
{
"partOfSpeech": "n.",
"text": "One of an order of nuns established on the principles of the Jesuits, but suppressed by Pope Urban in 1633."
}
],
"jesuitic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jesuitical"
}
],
"jesuitical": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jesuits, or to their principles and methods."
},
{
"partOfSpeech": "a.",
"text": "Designing; cunning; deceitful; crafty; -- an opprobrious use of the word."
}
],
"jesuitically": [
{
"partOfSpeech": "adv.",
"text": "In a jesuitical manner."
}
],
"jesuitism": [
{
"partOfSpeech": "n.",
"text": "The principles and practices of the Jesuits."
},
{
"partOfSpeech": "n.",
"text": "Cunning; deceit; deceptive practices to effect a purpose; subtle argument; -- an opprobrious use of the  word."
}
],
"jesuitocracy": [
{
"partOfSpeech": "n.",
"text": "Government by Jesuits; also, the whole body of Jesuits in a country."
}
],
"jesuitry": [
{
"partOfSpeech": "n.",
"text": "Jesuitism; subtle argument."
}
],
"jesus": [
{
"partOfSpeech": "n.",
"text": "The Savior; the name of the Son of God as announced by the angel to his parents; the personal name of Our Lord, in distinction from Christ, his official appellation."
}
],
"jet": [
{
"partOfSpeech": "n.",
"text": "Same as 2d Get."
},
{
"partOfSpeech": "n.",
"text": "A variety of lignite, of a very compact texture and velvet black color, susceptible of a good polish, and often wrought into mourning jewelry, toys, buttons, etc. Formerly called also black amber."
},
{
"partOfSpeech": "n.",
"text": "A shooting forth; a spouting; a spurt; a sudden rush or gush, as of water from a pipe, or of flame from an orifice; also, that which issues in a jet."
},
{
"partOfSpeech": "n.",
"text": "Drift; scope; range, as of an argument."
},
{
"partOfSpeech": "n.",
"text": "The sprue of a type, which is broken from it when the type is cold."
},
{
"partOfSpeech": "v. i.",
"text": "To strut; to walk with a lofty or haughty gait; to be insolent; to obtrude."
},
{
"partOfSpeech": "v. i.",
"text": "To jerk; to jolt; to be shaken."
},
{
"partOfSpeech": "v. i.",
"text": "To shoot forward or out; to project; to jut out."
},
{
"partOfSpeech": "v. t.",
"text": "To spout; to emit in a stream or jet."
}
],
"jetted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jet"
}
],
"jetting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jet"
}
],
"jet-black": [
{
"partOfSpeech": "a.",
"text": "Black as jet; deep black."
}
],
"jets d'eau": [
{
"partOfSpeech": "pl. ",
"text": "of Jet d'eau"
},
{
"partOfSpeech": "pl. ",
"text": "of Jet d'eau"
}
],
"jet d'eau": [
{
"partOfSpeech": "",
"text": "A stream of water spouting from a fountain or pipeespecially from one arranged to throw water upward), in a public place or in a garden, for ornament."
},
{
"partOfSpeech": "",
"text": "A stream of water spouting, esp. upward, from a fountain or pipe for ornament; also, the fountain or pipe from which it issues."
}
],
"jeterus": [
{
"partOfSpeech": "n.",
"text": "A yellowness of the parts of plants which are normally green; yellows."
}
],
"jetsam": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jetson"
}
],
"jetson": [
{
"partOfSpeech": "n.",
"text": "Goods which sink when cast into the sea, and remain under water; -- distinguished from flotsam, goods which float, and ligan, goods which are sunk attached to a buoy."
},
{
"partOfSpeech": "n.",
"text": "Jettison. See Jettison, 1."
}
],
"jetteau": [
{
"partOfSpeech": "n.",
"text": "See Jet d'eau."
}
],
"jettee": [
{
"partOfSpeech": "n.",
"text": "See Jetty, n."
}
],
"jetter": [
{
"partOfSpeech": "n.",
"text": "One who struts; one who bears himself jauntily; a fop."
}
],
"jettiness": [
{
"partOfSpeech": "n.",
"text": "The state of being jetty; blackness."
}
],
"jettison": [
{
"partOfSpeech": "n.",
"text": "The throwing overboard of goods from necessity, in order to lighten a vessel in danger of wreck."
},
{
"partOfSpeech": "n.",
"text": "See Jetsam, 1."
}
],
"jetton": [
{
"partOfSpeech": "n.",
"text": "A metal counter used in playing cards."
}
],
"jetty": [
{
"partOfSpeech": "a.",
"text": "Made of jet, or like jet in color."
},
{
"partOfSpeech": "n.",
"text": "A part of a building that jets or projects beyond the rest, and overhangs the wall below."
},
{
"partOfSpeech": "n.",
"text": "A wharf or pier extending from the shore."
},
{
"partOfSpeech": "n.",
"text": "A structure of wood or stone extended into the sea to influence the current or tide, or to protect a harbor; a mole; as, the Eads system of jetties at the mouth of the Mississippi River."
},
{
"partOfSpeech": "v. i.",
"text": "To jut out; to project."
}
],
"jetties": [
{
"partOfSpeech": "pl. ",
"text": "of Jetty"
}
],
"jeu d'esprit": [
{
"partOfSpeech": "",
"text": "A witticism."
}
],
"jew": [
{
"partOfSpeech": "n.",
"text": "Originally, one belonging to the tribe or kingdom of Judah; after the return from the Babylonish captivity, any member of the new state; a Hebrew; an Israelite."
}
],
"jewbush": [
{
"partOfSpeech": "n.",
"text": "A euphorbiaceous shrub of the genus PedilanthusP. tithymaloides), found in the West Indies, and possessing powerful emetic and drastic qualities."
}
],
"jewel": [
{
"partOfSpeech": "n.",
"text": "An ornament of dress usually made of a precious metal, and having enamel or precious stones as a part of its design."
},
{
"partOfSpeech": "n.",
"text": "A precious stone; a gem."
},
{
"partOfSpeech": "n.",
"text": "An object regarded with special affection; a precious thing."
},
{
"partOfSpeech": "n.",
"text": "A bearing for a pivot a pivot in a watch, formed of a crystal or precious stone, as a ruby."
},
{
"partOfSpeech": "v. t.",
"text": "To dress, adorn, deck, or supply with jewels, as a dress, a sword hilt, or a watch; to bespangle, as with jewels."
}
],
"jeweled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jewel"
}
],
"jewelled": [
{
"partOfSpeech": "",
"text": "of Jewel"
}
],
"jeweling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jewel"
}
],
"jewelling": [
{
"partOfSpeech": "",
"text": "of Jewel"
}
],
"jeweler": [
{
"partOfSpeech": "n.",
"text": "One who makes, or deals in, jewels, precious stones, and similar ornaments."
}
],
"jewellery": [
{
"partOfSpeech": "n.",
"text": "See Jewelry."
}
],
"jewelry": [
{
"partOfSpeech": "n.",
"text": "The art or trade of a jeweler."
},
{
"partOfSpeech": "n.",
"text": "Jewels, collectively; as, a bride's jewelry."
}
],
"jewelweed": [
{
"partOfSpeech": "n.",
"text": "See Impatiens."
}
],
"jewess": [
{
"partOfSpeech": "fem.",
"text": "A Hebrew woman."
}
],
"jewfish": [
{
"partOfSpeech": "n.",
"text": "A very large serranoid fishPromicrops itaiara) of Florida and the Gulf of Mexico. It often reaches the weight of five hundred pounds. Its color is olivaceous or yellowish, with numerous brown spots. Called also guasa, and warsaw."
},
{
"partOfSpeech": "n.",
"text": "A similar gigantic fishStereolepis gigas) of Southern California, valued as a food fish."
},
{
"partOfSpeech": "n.",
"text": "The black grouper of Florida and Texas."
},
{
"partOfSpeech": "n.",
"text": "A large herringlike fish; the tarpum."
}
],
"jewise": [
{
"partOfSpeech": "n.",
"text": "Same as Juise."
}
],
"jewish": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jews or Hebrews; characteristic of or resembling the Jews or their customs; Israelitish."
}
],
"jewry": [
{
"partOfSpeech": "n.",
"text": "Judea; also, a district inhabited by Jews; a Jews' quarter."
}
],
"jew's-ear": [
{
"partOfSpeech": "n.",
"text": "A species of fungusHirneola Auricula-Judae, / Auricula), bearing some resemblance to the human ear."
}
],
"jew's-harp": [
{
"partOfSpeech": "n.",
"text": "An instrument of music, which, when placed between the teeth, gives, by means of a bent metal tongue struck by the finger, a sound which is modulated by the breath; -- called also Jew's-trump."
},
{
"partOfSpeech": "n.",
"text": "The shackle for joining a chain cable to an anchor."
}
],
"jew's-stone": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jewstone"
}
],
"jewstone": [
{
"partOfSpeech": "n.",
"text": "A large clavate spine of a fossil sea urchin."
}
],
"jezebel": [
{
"partOfSpeech": "n.",
"text": "A bold, vicious woman; a termagant."
}
],
"jharal": [
{
"partOfSpeech": "n.",
"text": "A wild goatCapra Jemlaica) which inhabits the loftiest mountains of India. It has long, coarse hair, forming a thick mane on its head and neck."
}
],
"jib": [
{
"partOfSpeech": "v. i.",
"text": "A triangular sail set upon a stay or halyard extending from the foremast or fore-topmast to the bowsprit or the jib boom. Large vessels often carry several jibe; as, inner jib; outer jib; flying jib; etc."
},
{
"partOfSpeech": "v. i.",
"text": "The projecting arm of a crane, from which the load is suspended."
},
{
"partOfSpeech": "v. i.",
"text": "To move restively backward or sidewise, -- said of a horse; to balk."
},
{
"partOfSpeech": "n.",
"text": "One that jibs, or balks; a jibber."
},
{
"partOfSpeech": "n.",
"text": "A stationary condition; a standstill."
},
{
"partOfSpeech": "",
"text": "Alt. of Jibb"
}
],
"jibber": [
{
"partOfSpeech": "n.",
"text": "A horse that jibs."
}
],
"jibed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jibe"
}
],
"jibing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jibe"
}
],
"jibe": [
{
"partOfSpeech": "v. i.",
"text": "To shift, as the boom of a fore-and-aft sail, from one side of a vessel to the other when the wind is aft or on the quarter. See Gybe."
},
{
"partOfSpeech": "v. i.",
"text": "To change a ship's course so as to cause a shifting of the boom. See Jibe, v. t., and Gybe."
},
{
"partOfSpeech": "v. t.",
"text": "To agree; to harmonize."
}
],
"jiffy": [
{
"partOfSpeech": "n.",
"text": "A moment; an instant; as, I will be ready in a jiffy."
}
],
"jig": [
{
"partOfSpeech": "n.",
"text": "A light, brisk musical movement."
},
{
"partOfSpeech": "n.",
"text": "A light, humorous piece of writing, esp. in rhyme; a farce in verse; a ballad."
},
{
"partOfSpeech": "n.",
"text": "A piece of sport; a trick; a prank."
},
{
"partOfSpeech": "n.",
"text": "A trolling bait, consisting of a bright spoon and a hook attached."
},
{
"partOfSpeech": "n.",
"text": "A small machine or handy tool"
},
{
"partOfSpeech": "n.",
"text": "A contrivance fastened to or inclosing a piece of work, and having hard steel surfaces to guide a tool, as a drill, or to form a shield or templet to work to, as in filing."
},
{
"partOfSpeech": "n.",
"text": "An apparatus or a machine for jigging ore."
},
{
"partOfSpeech": "v. t.",
"text": "To sing to the tune of a jig."
},
{
"partOfSpeech": "v. t.",
"text": "To trick or cheat; to cajole; to delude."
},
{
"partOfSpeech": "v. t.",
"text": "To sort or separate, as ore in a jigger or sieve. See Jigging, n."
},
{
"partOfSpeech": "n.",
"text": "To cut or form, as a piece of metal, in a jigging machine."
},
{
"partOfSpeech": "v. i.",
"text": "To dance a jig; to skip about."
},
{
"partOfSpeech": "v. i.",
"text": "To move with a skip or rhythm; to move with vibrations or jerks."
}
],
"jigged": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jig"
}
],
"jigging": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jig"
},
{
"partOfSpeech": "n.",
"text": "The act or using a jig; the act of separating ore with a jigger, or wire-bottomed sieve, which is moved up and down in water."
}
],
"jigger": [
{
"partOfSpeech": "n.",
"text": "A species of fleaSarcopsylla, / Pulex, penetrans), which burrows beneath the skin. See Chigoe."
},
{
"partOfSpeech": "n. & v.",
"text": "One who, or that which, jigs; specifically, a miner who sorts or cleans ore by the process of jigging; also, the sieve used in jigging."
},
{
"partOfSpeech": "n. & v.",
"text": "A horizontal table carrying a revolving mold, on which earthen vessels are shaped by rapid motion; a potter's wheel."
},
{
"partOfSpeech": "n. & v.",
"text": "A templet or tool by which vessels are shaped on a potter's wheel."
},
{
"partOfSpeech": "n. & v.",
"text": "A light tackle, consisting of a double and single block and the fall, used for various purposes, as to increase the purchase on a topsail sheet in hauling it home; the watch tackle."
},
{
"partOfSpeech": "n. & v.",
"text": "A small fishing vessel, rigged like a yawl."
},
{
"partOfSpeech": "n. & v.",
"text": "A supplementary sail. See Dandy, n., 2b)."
},
{
"partOfSpeech": "n.",
"text": "A pendulum rolling machine for slicking or graining leather; same as Jack, 4i)."
},
{
"partOfSpeech": "n.",
"text": "Any one of several species of small red mitesesp. Tetranychus irritans and T. Americanus) which, in the larval or leptus stage, burrow beneath the skin of man and various animals, causing great annoyance."
},
{
"partOfSpeech": "v. t.",
"text": "To move, send, or drive with a jerk; to jerk; also, to drive or send over with a jerk, as a golf ball."
}
],
"jiggish": [
{
"partOfSpeech": "a.",
"text": "Resembling, or suitable for, a jig, or lively movement."
},
{
"partOfSpeech": "a.",
"text": "Playful; frisky."
}
],
"jiggle": [
{
"partOfSpeech": "v. i.",
"text": "To wriggle or frisk about; to move awkwardly; to shake up and down."
}
],
"jigjog": [
{
"partOfSpeech": "n.",
"text": "A jolting motion; a jogging pace."
},
{
"partOfSpeech": "a.",
"text": "Having a jolting motion."
}
],
"jill": [
{
"partOfSpeech": "n.",
"text": "A young woman; a sweetheart. See Gill."
}
],
"jill-flirt": [
{
"partOfSpeech": "n.",
"text": "A light, giddy, or wanton girl or woman. See Gill-flirt."
}
],
"jilt": [
{
"partOfSpeech": "n.",
"text": "A woman who capriciously deceives her lover; a coquette; a flirt."
},
{
"partOfSpeech": "v. t.",
"text": "To cast off capriciously or unfeeling, as a lover; to deceive in love."
},
{
"partOfSpeech": "v. i.",
"text": "To play the jilt; to practice deception in love; to discard lovers capriciously."
}
],
"jilted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jilt"
}
],
"jilting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jilt"
}
],
"jimcrack": [
{
"partOfSpeech": "n.",
"text": "See Gimcrack."
}
],
"jim-crow": [
{
"partOfSpeech": "n.",
"text": "A machine for bending or straightening rails."
},
{
"partOfSpeech": "n.",
"text": "A planing machine with a reversing tool, to plane both ways."
}
],
"jimmies": [
{
"partOfSpeech": "pl. ",
"text": "of Jimmy"
}
],
"jimmy": [
{
"partOfSpeech": "n.",
"text": "A short crowbar used by burglars in breaking open doors."
}
],
"jimp": [
{
"partOfSpeech": "a.",
"text": "Neat; handsome; elegant. See Gimp."
}
],
"jimson weed": [
{
"partOfSpeech": "",
"text": "See Jamestown weed."
}
],
"jin": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jinn"
}
],
"jinn": [
{
"partOfSpeech": "n.",
"text": "See Jinnee."
},
{
"partOfSpeech": "pl. ",
"text": "of Jinnee"
}
],
"jingal": [
{
"partOfSpeech": "n.",
"text": "A small portable piece of ordnance, mounted on a swivel."
}
],
"jingle": [
{
"partOfSpeech": "v. i.",
"text": "To sound with a fine, sharp, rattling, clinking, or tinkling sound; as, sleigh bells jingle."
},
{
"partOfSpeech": "v. i.",
"text": "To rhyme or sound with a jingling effect."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to give a sharp metallic sound as a little bell, or as coins shaken together; to tinkle."
},
{
"partOfSpeech": "n.",
"text": "A rattling, clinking, or tinkling sound, as of little bells or pieces of metal."
},
{
"partOfSpeech": "n.",
"text": "That which makes a jingling sound, as a rattle."
},
{
"partOfSpeech": "n.",
"text": "A correspondence of sound in rhymes, especially when the verse has little merit; hence, the verse itself."
}
],
"jingled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jingle"
}
],
"jingling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jingle"
},
{
"partOfSpeech": "n.",
"text": "The act or process of producing a jingle; also, the sound itself; a chink."
}
],
"jingler": [
{
"partOfSpeech": "n.",
"text": "One who, or that which, jingles."
}
],
"jinglingly": [
{
"partOfSpeech": "adv.",
"text": "So as to jingle."
}
],
"jingoes": [
{
"partOfSpeech": "pl. ",
"text": "of Jingo"
}
],
"jingo": [
{
"partOfSpeech": "n.",
"text": "A word used as a jocular oath."
},
{
"partOfSpeech": "n.",
"text": "A statesman who pursues, or who favors, aggressive, domineering policy in foreign affairs."
}
],
"jingoism": [
{
"partOfSpeech": "n.",
"text": "The policy of the Jingoes, so called. See Jingo, 2."
}
],
"jinnee": [
{
"partOfSpeech": "n.",
"text": "A genius or demon; one of the fabled genii, good and evil spirits, supposed to be the children of fire, and to have the power of assuming various forms."
}
],
"jinny road": [
{
"partOfSpeech": "",
"text": "An inclined road in a coal mine, on which loaded cars descend by gravity, drawing up empty ones."
}
],
"jinrikisha": [
{
"partOfSpeech": "n.",
"text": "A small, two-wheeled, hooded vehicle drawn by one more men."
}
],
"jippo": [
{
"partOfSpeech": "n.",
"text": "A waistcoat or kind of stays for women."
}
],
"joes": [
{
"partOfSpeech": "pl. ",
"text": "of Jo"
}
],
"jo": [
{
"partOfSpeech": "n.",
"text": "A sweetheart; a darling."
}
],
"job": [
{
"partOfSpeech": "n.",
"text": "A sudden thrust or stab; a jab."
},
{
"partOfSpeech": "n.",
"text": "A piece of chance or occasional work; any definite work undertaken in gross for a fixed price; as, he did the job for a thousand dollars."
},
{
"partOfSpeech": "n.",
"text": "A public transaction done for private profit; something performed ostensibly as a part of official duty, but really for private gain; a corrupt official business."
},
{
"partOfSpeech": "n.",
"text": "Any affair or event which affects one, whether fortunately or unfortunately."
},
{
"partOfSpeech": "n.",
"text": "A situation or opportunity of work; as, he lost his job."
},
{
"partOfSpeech": "v. t.",
"text": "To strike or stab with a pointed instrument."
},
{
"partOfSpeech": "v. t.",
"text": "To thrust in, as a pointed instrument."
},
{
"partOfSpeech": "v. t.",
"text": "To do or cause to be done by separate portions or lots; to subletwork); as, to job a contract."
},
{
"partOfSpeech": "v. t.",
"text": "To buy and sell, as a broker; to purchase of importers or manufacturers for the purpose of selling to retailers; as, to job goods."
},
{
"partOfSpeech": "v. t.",
"text": "To hire or let by the job or for a period of service; as, to job a carriage."
},
{
"partOfSpeech": "v. i.",
"text": "To do chance work for hire; to work by the piece; to do petty work."
},
{
"partOfSpeech": "v. i.",
"text": "To seek private gain under pretense of public service; to turn public matters to private advantage."
},
{
"partOfSpeech": "v. i.",
"text": "To carry on the business of a jobber in merchandise or stocks."
},
{
"partOfSpeech": "n.",
"text": "The hero of the book of that name in the Old Testament; the typical patient man."
}
],
"jobbed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Job"
}
],
"jobbing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Job"
},
{
"partOfSpeech": "a.",
"text": "Doing chance work or add jobs; as, a jobbing carpenter."
},
{
"partOfSpeech": "a.",
"text": "Using opportunities of public service for private gain; as, a jobbing politician."
}
],
"jobation": [
{
"partOfSpeech": "n.",
"text": "A scolding; a hand, tedious reproof."
}
],
"jobber": [
{
"partOfSpeech": "n.",
"text": "One who works by the job."
},
{
"partOfSpeech": "n.",
"text": "A dealer in the public stocks or funds; a stockjobber."
},
{
"partOfSpeech": "n.",
"text": "One who buys goods from importers, wholesalers, or manufacturers, and sells to retailers."
},
{
"partOfSpeech": "n.",
"text": "One who turns official or public business to private advantage; hence, one who performs low or mercenary work in office, politics, or intrigue."
}
],
"jobbernowl": [
{
"partOfSpeech": "n.",
"text": "A blockhead."
}
],
"jobbery": [
{
"partOfSpeech": "n.",
"text": "The act or practice of jobbing."
},
{
"partOfSpeech": "n.",
"text": "Underhand management; official corruption; as, municipal jobbery."
}
],
"jocantry": [
{
"partOfSpeech": "n.",
"text": "The act or practice of jesting."
}
],
"jockeys": [
{
"partOfSpeech": "pl. ",
"text": "of Jockey"
}
],
"jockey": [
{
"partOfSpeech": "n.",
"text": "A professional rider of horses in races."
},
{
"partOfSpeech": "n.",
"text": "A dealer in horses; a horse trader."
},
{
"partOfSpeech": "n.",
"text": "A cheat; one given to sharp practice in trade."
},
{
"partOfSpeech": "v. t.",
"text": "\" To jostle by riding against one.\""
},
{
"partOfSpeech": "v. t.",
"text": "To play the jockey toward; to cheat; to trick; to impose upon in trade; as, to jockey a customer."
},
{
"partOfSpeech": "v. i.",
"text": "To play or act the jockey; to cheat."
}
],
"jockeyed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jockey"
}
],
"jockeying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jockey"
},
{
"partOfSpeech": "n.",
"text": "The act or management of one who jockeys; trickery."
}
],
"jockeyism": [
{
"partOfSpeech": "n.",
"text": "The practice of jockeys."
}
],
"jockeyship": [
{
"partOfSpeech": "n.",
"text": "The art, character, or position, of a jockey; the personality of a jockey."
}
],
"jocose": [
{
"partOfSpeech": "a.",
"text": "Given to jokes and jesting; containing a joke, or abounding in jokes; merry; sportive; humorous."
}
],
"jocoserious": [
{
"partOfSpeech": "a.",
"text": "Mingling mirth and seriousness."
}
],
"jocosity": [
{
"partOfSpeech": "n.",
"text": "A jocose act or saying; jocoseness."
}
],
"jocular": [
{
"partOfSpeech": "a.",
"text": "Given to jesting; jocose; as, a jocular person."
},
{
"partOfSpeech": "a.",
"text": "Sportive; merry."
}
],
"jocularity": [
{
"partOfSpeech": "n.",
"text": "Jesting; merriment."
}
],
"jocularly": [
{
"partOfSpeech": "adv.",
"text": "In jest; for sport or mirth; jocosely."
}
],
"joculary": [
{
"partOfSpeech": "a.",
"text": "Jocular; jocose; sportive."
}
],
"joculator": [
{
"partOfSpeech": "n.",
"text": "A jester; a joker."
}
],
"joculatory": [
{
"partOfSpeech": "a.",
"text": "Droll; sportive."
}
],
"jocund": [
{
"partOfSpeech": "",
"text": "Merry; cheerful; gay; airy; lively; sportive."
},
{
"partOfSpeech": "adv.",
"text": "Merrily; cheerfully."
}
],
"jocundity": [
{
"partOfSpeech": "n.",
"text": "The state or quality of being jocund; gayety; sportiveness."
}
],
"joe": [
{
"partOfSpeech": "n.",
"text": "See Johannes."
}
],
"joe miller": [
{
"partOfSpeech": "",
"text": "A jest book; a stale jest; a worn-out joke."
}
],
"joe-pye weed": [
{
"partOfSpeech": "",
"text": "A tall composite plant of the genus EupatoriumE. purpureum), with purplish flowers, and whorled leaves."
}
],
"jogged": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jog"
}
],
"jogging": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jog"
},
{
"partOfSpeech": "n.",
"text": "The act of giving a jog or jogs; traveling at a jog."
}
],
"jog": [
{
"partOfSpeech": "v. t.",
"text": "To push or shake with the elbow or hand; to jostle; esp., to push or touch, in order to give notice, to excite one's attention, or to warn."
},
{
"partOfSpeech": "v. t.",
"text": "To suggest to; to notify; to remind; to call the attention of; as, to jog the memory."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to jog; to drive at a jog, as a horse. See Jog, v. i."
},
{
"partOfSpeech": "v. i.",
"text": "To move by jogs or small shocks, like those of a slow trot; to move slowly, leisurely, or monotonously; -- usually with on, sometimes with over."
},
{
"partOfSpeech": "n.",
"text": "A slight shake; a shake or push intended to give notice or awaken attention; a push; a jolt."
},
{
"partOfSpeech": "n.",
"text": "A rub; a slight stop; an obstruction; hence, an irregularity in motion of from; a hitch; a break in the direction of a line or the surface of a plane."
}
],
"jogger": [
{
"partOfSpeech": "n.",
"text": "One who jogs."
}
],
"joggled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Joggle"
}
],
"joggling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Joggle"
}
],
"joggle": [
{
"partOfSpeech": "v. t.",
"text": "To shake slightly; to push suddenly but slightly, so as to cause to shake or totter; to jostle; to jog."
},
{
"partOfSpeech": "v. t.",
"text": "To join by means of joggles, so as to prevent sliding apart; sometimes, loosely, to dowel."
},
{
"partOfSpeech": "v. i.",
"text": "To shake or totter; to slip out of place."
},
{
"partOfSpeech": "n.",
"text": "A notch or tooth in the joining surface of any piece of building material to prevent slipping; sometimes, but incorrectly, applied to a separate piece fitted into two adjacent stones, or the like."
}
],
"johannean": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to John, esp. to the Apostle John or his writings."
}
],
"johannes": [
{
"partOfSpeech": "n.",
"text": "A Portuguese gold coin of the value of eight dollars, named from the figure of King John which it bears; -- often contracted into joe; as, a joe, or a half joe."
}
],
"johannisberger": [
{
"partOfSpeech": "n.",
"text": "A fine white wine produced on the estate of Schlossor Castle) Johannisberg, on the Rhine."
}
],
"john": [
{
"partOfSpeech": "n.",
"text": "A proper name of a man."
}
],
"johnadreams": [
{
"partOfSpeech": "n.",
"text": "A dreamy, idle fellow."
}
],
"johnnies": [
{
"partOfSpeech": "pl. ",
"text": "of Johnny"
}
],
"johnny": [
{
"partOfSpeech": "n.",
"text": "A familiar diminutive of John."
},
{
"partOfSpeech": "n.",
"text": "A sculpin."
}
],
"johnnycake": [
{
"partOfSpeech": "n.",
"text": "A kind of bread made of the meal of maizeIndian corn), mixed with water or milk, etc., and baked."
}
],
"johnsonese": [
{
"partOfSpeech": "n.",
"text": "The literary style of Dr. Samuel Johnson, or one formed in imitation of it; an inflated, stilted, or pompous style, affecting classical words."
}
],
"johnson grass": [
{
"partOfSpeech": "",
"text": "A tall perennial grassSorghum Halepense), valuable in the Southern and Western States for pasture and hay. The rootstocks are large and juicy and are eagerly sought by swine. Called also Cuba grass, Means grass, Evergreen millet, and Arabian millet."
}
],
"johnsonian": [
{
"partOfSpeech": "a.",
"text": "Pertaining to or resembling Dr. Johnson or his style; pompous; inflated."
}
],
"johnsonianism": [
{
"partOfSpeech": "n.",
"text": "A manner of acting or of writing peculiar to, or characteristic of, Dr. Johnson."
}
],
"john's-wort": [
{
"partOfSpeech": "n.",
"text": "See St. John's-wort."
}
],
"joined": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Join"
}
],
"joining": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Join"
}
],
"join": [
{
"partOfSpeech": "v. t.",
"text": "To bring together, literally or figuratively; to place in contact; to connect; to couple; to unite; to combine; to associate; to add; to append."
},
{
"partOfSpeech": "v. t.",
"text": "To associate one's self to; to be or become connected with; to league one's self with; to unite with; as, to join a party; to join the church."
},
{
"partOfSpeech": "v. t.",
"text": "To unite in marriage."
},
{
"partOfSpeech": "v. t.",
"text": "To enjoin upon; to command."
},
{
"partOfSpeech": "v. t.",
"text": "To accept, or engage in, as a contest; as, to join encounter, battle, issue."
},
{
"partOfSpeech": "v. i.",
"text": "To be contiguous, close, or in contact; to come together; to unite; to mingle; to form a union; as, the hones of the skull join; two rivers join."
},
{
"partOfSpeech": "n.",
"text": "The line joining two points; the point common to two intersecting lines."
}
],
"joinant": [
{
"partOfSpeech": "a.",
"text": "Adjoining."
}
],
"joinder": [
{
"partOfSpeech": "v. t.",
"text": "The act of joining; a putting together; conjunction."
},
{
"partOfSpeech": "v. t.",
"text": "A joining of parties as plaintiffs or defendants in a suit."
},
{
"partOfSpeech": "v. t.",
"text": "Acceptance of an issue tendered in law or fact."
},
{
"partOfSpeech": "v. t.",
"text": "A joining of causes of action or defense in civil suits or criminal prosecutions."
}
],
"joiner": [
{
"partOfSpeech": "n.",
"text": "One who, or that which, joins."
},
{
"partOfSpeech": "n.",
"text": "One whose occupation is to construct articles by joining pieces of wood; a mechanic who does the woodworkas doors, stairs, etc.) necessary for the finishing of buildings."
},
{
"partOfSpeech": "n.",
"text": "A wood-working machine, for sawing, plaining, mortising, tenoning, grooving, etc."
}
],
"joinery": [
{
"partOfSpeech": "n.",
"text": "The art, or trade, of a joiner; the work of a joiner."
}
],
"joinhand": [
{
"partOfSpeech": "n.",
"text": "Writing in which letters are joined in words; -- distinguished from writing in single letters."
}
],
"joint": [
{
"partOfSpeech": "n.",
"text": "The place or part where two things or parts are joined or united; the union of two or more smooth or even surfaces admitting of a close-fitting or junction; junction as, a joint between two pieces of timber; a joint in a pipe."
},
{
"partOfSpeech": "n.",
"text": "A joining of two things or parts so as to admit of motion; an articulation, whether movable or not; a hinge; as, the knee joint; a node or joint of a stem; a ball and socket joint.  See Articulation."
},
{
"partOfSpeech": "n.",
"text": "The part or space included between two joints, knots, nodes, or articulations; as, a joint of cane or of a grass stem; a joint of the leg."
},
{
"partOfSpeech": "n.",
"text": "Any one of the large pieces of meat, as cut into portions by the butcher for roasting."
},
{
"partOfSpeech": "n.",
"text": "A plane of fracture, or divisional plane, of a rock transverse to the stratification."
},
{
"partOfSpeech": "n.",
"text": "The space between the adjacent surfaces of two bodies joined and held together, as by means of cement, mortar, etc.; as, a thin joint."
},
{
"partOfSpeech": "n.",
"text": "The means whereby the meeting surfaces of pieces in a structure are secured together."
},
{
"partOfSpeech": "a.",
"text": "Joined; united; combined; concerted; as joint action."
},
{
"partOfSpeech": "a.",
"text": "Involving the united activity of two or more; done or produced by two or more working together."
},
{
"partOfSpeech": "a.",
"text": "United, joined, or sharing with another or with others; not solitary in interest or action; holding in common with an associate, or with associates; acting together; as, joint heir; joint creditor; joint debtor, etc."
},
{
"partOfSpeech": "a.",
"text": "Shared by, or affecting two or more; held in common; as, joint property; a joint bond."
},
{
"partOfSpeech": "v. t.",
"text": "To unite by a joint or joints; to fit together; to prepare so as to fit together; as, to joint boards."
},
{
"partOfSpeech": "v. t.",
"text": "To join; to connect; to unite; to combine."
},
{
"partOfSpeech": "v. t.",
"text": "To provide with a joint or joints; to articulate."
},
{
"partOfSpeech": "v. t.",
"text": "To separate the joints; of; to divide at the joint or joints; to disjoint; to cut up into joints, as meat."
},
{
"partOfSpeech": "v. i.",
"text": "To fit as if by joints; to coalesce as joints do; as, the stones joint, neatly."
},
{
"partOfSpeech": "n.",
"text": "A projecting or retreating part in something; any irregularity of line or surface, as in a wall."
},
{
"partOfSpeech": "n.",
"text": "A narrow piece of scenery used to join together two flats or wings of an interior setting."
},
{
"partOfSpeech": "n.",
"text": "A place of low resort, as for smoking opium."
}
],
"jointed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Joint"
},
{
"partOfSpeech": "a.",
"text": "Having joints; articulated; full of nodes; knotty; as, a jointed doll; jointed structure."
}
],
"jointing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Joint"
},
{
"partOfSpeech": "n.",
"text": "The act or process of making a joint; also, the joints thus produced."
}
],
"jointer": [
{
"partOfSpeech": "n.",
"text": "One who, or that which, joints."
},
{
"partOfSpeech": "n.",
"text": "A plane for smoothing the surfaces of pieces which are to be accurately joined"
},
{
"partOfSpeech": "n.",
"text": "The longest plane used by a joiner."
},
{
"partOfSpeech": "n.",
"text": "A long stationary plane, for plaining the edges of barrel staves."
},
{
"partOfSpeech": "n.",
"text": "A bent piece of iron inserted to strengthen the joints of a wall."
},
{
"partOfSpeech": "n.",
"text": "A tool for pointing the joints in brickwork."
}
],
"joint-fir": [
{
"partOfSpeech": "n.",
"text": "A genusEphedra) of leafless shrubs, with the stems conspicuously jointed; -- called also shrubby horsetail. There are about thirty species, of which two or three are found from Texas to California."
}
],
"jointless": [
{
"partOfSpeech": "a.",
"text": "Without a joint; rigid; stiff."
}
],
"jointly": [
{
"partOfSpeech": "adv.",
"text": "In a joint manner; together; unitedly; in concert; not separately."
}
],
"jointress": [
{
"partOfSpeech": "n.",
"text": "A woman who has a jointure."
}
],
"jointure": [
{
"partOfSpeech": "n.",
"text": "A joining; a joint."
},
{
"partOfSpeech": "n.",
"text": "An estate settled on a wife, which she is to enjoy after husband's decease, for her own life at least, in satisfaction of dower."
},
{
"partOfSpeech": "v. t.",
"text": "To settle a jointure upon."
}
],
"jointured": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jointure"
}
],
"jointuring": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jointure"
}
],
"jointureless": [
{
"partOfSpeech": "a.",
"text": "Having no jointure."
}
],
"jointuress": [
{
"partOfSpeech": "n.",
"text": "See Jointress."
}
],
"jointweed": [
{
"partOfSpeech": "n.",
"text": "A slender, nearly leafless, American herbPolygonum articulatum), with jointed spikes of small flowers."
}
],
"jointworm": [
{
"partOfSpeech": "n.",
"text": "The larva of a small, hymenopterous flyEurytoma hordei), which is found in gall-like swellings on the stalks of wheat, usually at or just above the first joint. In some parts of America it does great damage to the crop."
}
],
"joist": [
{
"partOfSpeech": "n.",
"text": "A piece of timber laid horizontally, or nearly so, to which the planks of the floor, or the laths or furring strips of a ceiling, are nailed; -- called, according to its position or use, binding joist, bridging joist, ceiling joist, trimming joist, etc. See Illust. of Double-framed floor, under Double, a."
},
{
"partOfSpeech": "v. t.",
"text": "To fit or furnish with joists."
}
],
"joisted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Joist"
}
],
"joisting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Joist"
}
],
"joke": [
{
"partOfSpeech": "n.",
"text": "Something said for the sake of exciting a laugh; something witty or sportivecommonly indicating more of hilarity or humor than jest); a jest; a witticism; as, to crack good-natured jokes."
},
{
"partOfSpeech": "n.",
"text": "Something not said seriously, or not actually meant; something done in sport."
},
{
"partOfSpeech": "v. t.",
"text": "To make merry with; to make jokes upon; to rally; to banter; as, to joke a comrade."
},
{
"partOfSpeech": "v. i.",
"text": "To do something for sport, or as a joke; to be merry in words or actions; to jest."
}
],
"joked": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Joke"
}
],
"joking": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Joke"
}
],
"joker": [
{
"partOfSpeech": "n.",
"text": "One who makes jokes or jests."
},
{
"partOfSpeech": "n.",
"text": "See Rest bower, under 2d Bower."
}
],
"jokingly": [
{
"partOfSpeech": "adv.",
"text": "In a joking way; sportively."
}
],
"jole": [
{
"partOfSpeech": "v. t. & n.",
"text": "Alt. of Joll"
}
],
"joll": [
{
"partOfSpeech": "v. t. & n.",
"text": "Same as Jowl."
}
],
"jolif": [
{
"partOfSpeech": "a.",
"text": "Joyful; merry; pleasant; jolly."
}
],
"jollification": [
{
"partOfSpeech": "n.",
"text": "A merrymaking; noisy festivity."
}
],
"jollily": [
{
"partOfSpeech": "adv.",
"text": "In a jolly manner."
}
],
"jolloment": [
{
"partOfSpeech": "n.",
"text": "Jollity."
}
],
"jolliness": [
{
"partOfSpeech": "n.",
"text": "Jollity; noisy mirth."
}
],
"jollity": [
{
"partOfSpeech": "n.",
"text": "Noisy mirth; gayety; merriment; festivity; boisterous enjoyment."
}
],
"jolly": [
{
"partOfSpeech": "superl.",
"text": "Full of life and mirth; jovial; joyous; merry; mirthful."
},
{
"partOfSpeech": "superl.",
"text": "Expressing mirth, or inspiring it; exciting mirth and gayety."
},
{
"partOfSpeech": "superl.",
"text": "Of fine appearance; handsome; excellent; lively; agreeable; pleasant."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to be jolly; to make good-natured; to encourage to feel pleasant or cheerful; -- often implying an insincere or bantering spirit; hence, to poke fun at."
},
{
"partOfSpeech": "a.",
"text": "A marine in the English navy."
}
],
"jolly-boat": [
{
"partOfSpeech": "n.",
"text": "A boat of medium size belonging to a ship."
}
],
"jollyhead": [
{
"partOfSpeech": "n.",
"text": "Jollity."
}
],
"jolted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jolt"
}
],
"jolt": [
{
"partOfSpeech": "v. i.",
"text": "To shake with short, abrupt risings and fallings, as a carriage moving on rough ground; as, the coach jolts."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to shake with a sudden up and down motion, as in a carriage going over rough ground, or on a high-trotting horse; as, the horse jolts the rider; fast driving jolts the carriage and the passengers."
},
{
"partOfSpeech": "n.",
"text": "A sudden shock or jerk; a jolting motion, as in a carriage moving over rough ground."
}
],
"jolter": [
{
"partOfSpeech": "n.",
"text": "One who, or that which, jolts."
}
],
"jolterhead": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jolthead"
}
],
"jolthead": [
{
"partOfSpeech": "n.",
"text": "A dunce; a blockhead."
}
],
"joltingly": [
{
"partOfSpeech": "adv.",
"text": "In a jolting manner."
}
],
"jolty": [
{
"partOfSpeech": "a.",
"text": "That jolts; as, a jolty coach."
}
],
"jonah": [
{
"partOfSpeech": "n.",
"text": "The Hebrew prophet, who was cast overboard as one who endangered the ship; hence, any person whose presence is unpropitious."
}
],
"jonesian": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Jones."
}
],
"jongleur": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jongler"
}
],
"jongler": [
{
"partOfSpeech": "n.",
"text": "In the Middle Ages, a court attendant or other person who, for hire, recited or sang verses, usually of his own composition. See Troubadour."
},
{
"partOfSpeech": "n.",
"text": "A juggler; a conjuror. See Juggler."
}
],
"jonquil": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jonquille"
}
],
"jonquille": [
{
"partOfSpeech": "n.",
"text": "A bulbous plant of the genus NarcissusN. Jonquilla), allied to the daffodil. It has long, rushlike leaves, and yellow or white fragrant flowers. The root has emetic properties. It is sometimes called the rush-leaved daffodil. See Illust. of Corona."
}
],
"joram": [
{
"partOfSpeech": "n.",
"text": "See Jorum."
}
],
"jordan": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jorden"
}
],
"jorden": [
{
"partOfSpeech": "n.",
"text": "A pot or vessel with a large neck, formerly used by physicians and alchemists."
},
{
"partOfSpeech": "n.",
"text": "A chamber pot."
}
],
"jorum": [
{
"partOfSpeech": "n.",
"text": "A large drinking vessel; also, its contents."
}
],
"joseph": [
{
"partOfSpeech": "n.",
"text": "An outer garment worn in the 18th century; esp., a woman's riding habit, buttoned down the front."
}
],
"joseph's flower": [
{
"partOfSpeech": "",
"text": "A composite herbTragopogon pratensis), of the same genus as the salsify."
}
],
"joso": [
{
"partOfSpeech": "n.",
"text": "A small gudgeon."
}
],
"joss": [
{
"partOfSpeech": "n.",
"text": "A Chinese household divinity; a Chinese idol."
}
],
"jossa": [
{
"partOfSpeech": "interj.",
"text": "A command to a horse, probably meaning \"stand still.\""
}
],
"jostled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jostle"
}
],
"jostling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jostle"
}
],
"jostle": [
{
"partOfSpeech": "v. t.",
"text": "To run against and shake; to push out of the way; to elbow; to hustle; to disturb by crowding; to crowd against."
},
{
"partOfSpeech": "v. i.",
"text": "To push; to crowd; to hustle."
},
{
"partOfSpeech": "n.",
"text": "A conflict by collisions; a crowding or bumping together; interference."
}
],
"jostlement": [
{
"partOfSpeech": "n.",
"text": "Crowding; hustling."
}
],
"jot": [
{
"partOfSpeech": "n.",
"text": "An iota; a point; a tittle; the smallest particle.  Cf. Bit, n."
},
{
"partOfSpeech": "v. t.",
"text": "To set down; to make a brief note of; -- usually followed by down."
}
],
"jotted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jot"
}
],
"jotting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jot"
}
],
"jotter": [
{
"partOfSpeech": "n.",
"text": "One who jots down memoranda."
},
{
"partOfSpeech": "n.",
"text": "A memorandum book."
}
],
"jougs": [
{
"partOfSpeech": "n.",
"text": "An iron collar fastened to a wall or post, formerly used in Scotland as a kind of pillory. [Written also juggs.] See Juke."
}
],
"jouissance": [
{
"partOfSpeech": "n.",
"text": "Jollity; merriment."
}
],
"jouk": [
{
"partOfSpeech": "v. i.",
"text": "See Juke."
}
],
"joul": [
{
"partOfSpeech": "v. t.",
"text": "See Jowl."
}
],
"joule": [
{
"partOfSpeech": "n.",
"text": "A unit of work which is equal to 107 units of work in the C. G. S. system of unitsergs), and is practically equivalent to the energy expended in one second by an electric current of one ampere in a resistance of one ohm. One joule is approximately equal to 0.738 foot pounds."
}
],
"jounced": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jounce"
}
],
"jouncing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jounce"
}
],
"jounce": [
{
"partOfSpeech": "v. t. & i.",
"text": "To jolt; to shake, especially by rough riding or by driving over obstructions."
},
{
"partOfSpeech": "n.",
"text": "A jolt; a shake; a hard trot."
}
],
"journal": [
{
"partOfSpeech": "a.",
"text": "Daily; diurnal."
},
{
"partOfSpeech": "a.",
"text": "A diary; an account of daily transactions and events."
},
{
"partOfSpeech": "a.",
"text": "A book of accounts, in which is entered a condensed and grouped statement of the daily transactions."
},
{
"partOfSpeech": "a.",
"text": "A daily register of the ship's course and distance, the winds, weather, incidents of the voyage, etc."
},
{
"partOfSpeech": "a.",
"text": "The record of daily proceedings, kept by the clerk."
},
{
"partOfSpeech": "a.",
"text": "A newspaper published daily; by extension, a weekly newspaper or any periodical publication, giving an account of passing events, the proceedings and memoirs of societies, etc."
},
{
"partOfSpeech": "a.",
"text": "That which has occurred in a day; a day's work or travel; a day's journey."
},
{
"partOfSpeech": "a.",
"text": "That portion of a rotating piece, as a shaft, axle, spindle, etc., which turns in a bearing or box. See Illust. of Axle box."
}
],
"journalism": [
{
"partOfSpeech": "n.",
"text": "The keeping of a journal or diary."
},
{
"partOfSpeech": "n.",
"text": "The periodical collection and publication of current news; the business of managing, editing, or writing for, journals or newspapers; as, political journalism."
}
],
"journalist": [
{
"partOfSpeech": "n.",
"text": "One who keeps a journal or diary."
},
{
"partOfSpeech": "n.",
"text": "The conductor of a public journal, or one whose business it to write for a public journal; an editorial or other professional writer for a periodical."
}
],
"journalistic": [
{
"partOfSpeech": "a.",
"text": "Pertaining to journals or to journalists; contained in, or characteristic of, the public journals; as journalistic literature or enterprise."
}
],
"journalized": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Journalize"
}
],
"journalizing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Journalize"
}
],
"journalize": [
{
"partOfSpeech": "v. t.",
"text": "To enter or record in a journal or diary."
},
{
"partOfSpeech": "v. i.",
"text": "to conduct or contribute to a public journal; to follow the profession of a journalist."
}
],
"journeys": [
{
"partOfSpeech": "pl. ",
"text": "of Journey"
}
],
"journey": [
{
"partOfSpeech": "n.",
"text": "The travel or work of a day."
},
{
"partOfSpeech": "n.",
"text": "Travel or passage from one place to another; hence, figuratively, a passage through life."
},
{
"partOfSpeech": "v. i.",
"text": "To travel from place to place; to go from home to a distance."
},
{
"partOfSpeech": "v. t.",
"text": "To traverse; to travel over or through."
}
],
"journeyed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Journey"
}
],
"journeying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Journey"
}
],
"journey-bated": [
{
"partOfSpeech": "a.",
"text": "Worn out with journeying."
}
],
"journeyer": [
{
"partOfSpeech": "n.",
"text": "One who journeys."
}
],
"journeymen": [
{
"partOfSpeech": "pl. ",
"text": "of Journeyman"
}
],
"journeyman": [
{
"partOfSpeech": "n.",
"text": "Formerly, a man hired to work by the day; now, commonly, one who has mastered a handicraft or trade; -- distinguished from apprentice and from master workman."
}
],
"journeywork": [
{
"partOfSpeech": "n.",
"text": "Originally, work done by the day; work done by a journeyman at his trade."
}
],
"joust": [
{
"partOfSpeech": "v. i.",
"text": "To engage in mock combat on horseback, as two knights in the lists; to tilt."
},
{
"partOfSpeech": "v. i.",
"text": "A tilting match; a mock combat on horseback between two knights in the lists or inclosed field."
}
],
"jouster": [
{
"partOfSpeech": "n.",
"text": "One who jousts or tilts."
}
],
"jove": [
{
"partOfSpeech": "n.",
"text": "The chief divinity of the ancient Romans; Jupiter."
},
{
"partOfSpeech": "n.",
"text": "The planet Jupiter."
},
{
"partOfSpeech": "n.",
"text": "The metal tin."
}
],
"jovial": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the god, or the planet, Jupiter."
},
{
"partOfSpeech": "a.",
"text": "Sunny; serene."
},
{
"partOfSpeech": "a.",
"text": "Gay; merry; joyous; jolly; mirth-inspiring; hilarious; characterized by mirth or jollity; as, a jovial youth; a jovial company; a jovial poem."
}
],
"jovialist": [
{
"partOfSpeech": "n.",
"text": "One who lives a jovial life."
}
],
"joviality": [
{
"partOfSpeech": "n.",
"text": "The quality or state of being jovial."
}
],
"jovially": [
{
"partOfSpeech": "adv.",
"text": "In a jovial manner; merrily; gayly."
}
],
"jovialness": [
{
"partOfSpeech": "n.",
"text": "Noisy mirth; joviality."
}
],
"jovialty": [
{
"partOfSpeech": "n.",
"text": "Joviality."
}
],
"jovian": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Jove, or Jupitereither the deity or the planet)."
}
],
"jovicentric": [
{
"partOfSpeech": "a.",
"text": "Revolving around the planet Jupiter; appearing as viewed from Jupiter."
}
],
"jovinianist": [
{
"partOfSpeech": "n.",
"text": "An adherent to the doctrines of Jovinian, a monk of the fourth century, who denied the virginity of Mary, and opposed the asceticism of his time."
}
],
"jowl": [
{
"partOfSpeech": "n.",
"text": "The cheek; the jaw."
},
{
"partOfSpeech": "v. t.",
"text": "To throw, dash, or knock."
}
],
"jowler": [
{
"partOfSpeech": "n.",
"text": "A dog with large jowls, as the beagle."
}
],
"jowter": [
{
"partOfSpeech": "n.",
"text": "A mounted peddler of fish; -- called also jouster."
}
],
"joy": [
{
"partOfSpeech": "n.",
"text": "The passion or emotion excited by the acquisition or expectation of good; pleasurable feelings or emotions caused by success, good fortune, and the like, or by a rational prospect of possessing what we love or desire; gladness; exhilaration of spirits; delight."
},
{
"partOfSpeech": "n.",
"text": "That which causes joy or happiness."
},
{
"partOfSpeech": "n.",
"text": "The sign or exhibition of joy; gayety; mirth; merriment; festivity."
},
{
"partOfSpeech": "n.",
"text": "To rejoice; to be glad; to delight; to exult."
},
{
"partOfSpeech": "v. t.",
"text": "To give joy to; to congratulate."
},
{
"partOfSpeech": "v. t.",
"text": "To gladden; to make joyful; to exhilarate."
},
{
"partOfSpeech": "v. t.",
"text": "To enjoy."
}
],
"joyed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Joy"
}
],
"joying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Joy"
}
],
"joyace": [
{
"partOfSpeech": "n.",
"text": "Enjoyment; gayety; festivity; joyfulness."
}
],
"joyancy": [
{
"partOfSpeech": "n.",
"text": "Joyance."
}
],
"joyful": [
{
"partOfSpeech": "a.",
"text": "Full of joy; having or causing joy; very glad; as, a joyful heart."
}
],
"joyless": [
{
"partOfSpeech": "a.",
"text": "Not having joy; not causing joy; unenjoyable."
}
],
"joyous": [
{
"partOfSpeech": "a.",
"text": "Glad; gay; merry; joyful; also, affording or inspiring joy; with of before the word or words expressing the cause of joy."
}
],
"joysome": [
{
"partOfSpeech": "a.",
"text": "Causing joyfulness."
}
],
"jub": [
{
"partOfSpeech": "n.",
"text": "A vessel for holding ale or wine; a jug."
}
],
"jubae": [
{
"partOfSpeech": "pl. ",
"text": "of Juba"
}
],
"juba": [
{
"partOfSpeech": "n.",
"text": "The mane of an animal."
},
{
"partOfSpeech": "n.",
"text": "A loose panicle, the axis of which falls to pieces, as in certain grasses."
}
],
"jubate": [
{
"partOfSpeech": "a.",
"text": "Fringed with long, pendent hair."
}
],
"jube": [
{
"partOfSpeech": "n.",
"text": "chancel screen or rood screen."
},
{
"partOfSpeech": "n.",
"text": "gallery above such a screen, from which certain parts of the service were formerly read."
}
],
"jubilant": [
{
"partOfSpeech": "a.",
"text": "Uttering songs of triumph; shouting with joy; triumphant; exulting."
}
],
"jubilantly": [
{
"partOfSpeech": "adv.",
"text": "In a jubilant manner."
}
],
"jubilar": [
{
"partOfSpeech": "a.",
"text": "Pertaining to, or having the character of, a jubilee."
}
],
"jubilate": [
{
"partOfSpeech": "n.",
"text": "The third Sunday after Easter; -- so called because the introit is the 66th Psalm, which, in the Latin version, begins with the words, \"Jubilate Deo.\""
},
{
"partOfSpeech": "n.",
"text": "A name of the 100th Psalm; -- so called from its opening word in the Latin version."
},
{
"partOfSpeech": "v. i.",
"text": "To exult; to rejoice."
}
],
"jubilation": [
{
"partOfSpeech": "n.",
"text": "A triumphant shouting; rejoicing; exultation."
}
],
"jubilee": [
{
"partOfSpeech": "n.",
"text": "Every fiftieth year, being the year following the completion of each seventh sabbath of years, at which time all the slaves of Hebrew blood were liberated, and all lands which had been alienated during the whole period reverted to their former owners."
},
{
"partOfSpeech": "n.",
"text": "The joyful commemoration held on the fiftieth anniversary of any event; as, the jubilee of Queen Victoria's reign; the jubilee of the American Board of Missions."
},
{
"partOfSpeech": "n.",
"text": "A church solemnity or ceremony celebrated at Rome, at stated intervals, originally of one hundred years, but latterly of twenty-five; a plenary and extraordinary indulgence grated by the sovereign pontiff to the universal church. One invariable condition of granting this indulgence is the confession of sins and receiving of the eucharist."
},
{
"partOfSpeech": "n.",
"text": "A season of general joy."
},
{
"partOfSpeech": "n.",
"text": "A state of joy or exultation."
},
{
"partOfSpeech": "",
"text": "One celebrated upon the completion of sixty, or, according to some, seventy-five, years from the beginning of the thing commemorated."
}
],
"jucundity": [
{
"partOfSpeech": "n.",
"text": "Pleasantness; agreeableness. See Jocundity."
}
],
"judahite": [
{
"partOfSpeech": "n.",
"text": "One of the tribe of Judah; a member of the kingdom of Judah; a Jew."
}
],
"judaic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Judaical"
}
],
"judaical": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Jews."
}
],
"judaically": [
{
"partOfSpeech": "adv.",
"text": "After the Jewish manner."
}
],
"judaism": [
{
"partOfSpeech": "n.",
"text": "The religious doctrines and rites of the Jews as enjoined in the laws of Moses."
},
{
"partOfSpeech": "n.",
"text": "Conformity to the Jewish rites and ceremonies."
}
],
"judaist": [
{
"partOfSpeech": "n.",
"text": "One who believes and practices Judaism."
}
],
"judaistic": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Judaism."
}
],
"judaization": [
{
"partOfSpeech": "n.",
"text": "The act of Judaizing; a conforming to the Jewish religion or ritual."
}
],
"judaized": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Judaize"
}
],
"judaizing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Judaize"
}
],
"judaize": [
{
"partOfSpeech": "v. i.",
"text": "To conform to the doctrines, observances, or methods of the Jews; to inculcate or impose Judaism."
},
{
"partOfSpeech": "v. t.",
"text": "To impose Jewish observances or rites upon; to convert to Judaism."
}
],
"judaizer": [
{
"partOfSpeech": "n.",
"text": "One who conforms to or inculcates Judaism; specifically, pl.Ch. Hist.), those Jews who accepted Christianity but still adhered to the law of Moses and worshiped in the temple at Jerusalem."
}
],
"judas": [
{
"partOfSpeech": "n.",
"text": "The disciple who betrayed Christ. Hence: A treacherous person; one who betrays under the semblance of friendship."
},
{
"partOfSpeech": "a.",
"text": "Treacherous; betraying."
}
],
"judas-colored": [
{
"partOfSpeech": "a.",
"text": "Red; -- from a tradition that Judas Iscariot had red hair and beard."
}
],
"juddock": [
{
"partOfSpeech": "n.",
"text": "See Jacksnipe."
}
],
"judean": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Judea."
},
{
"partOfSpeech": "n.",
"text": "A native of Judea; a Jew."
}
],
"judge": [
{
"partOfSpeech": "v. i.",
"text": "A public officer who is invested with authority to hear and determine litigated causes, and to administer justice between parties in courts held for that purpose."
},
{
"partOfSpeech": "v. i.",
"text": "One who has skill, knowledge, or experience, sufficient to decide on the merits of a question, or on the quality or value of anything; one who discerns properties or relations with skill and readiness; a connoisseur; an expert; a critic."
},
{
"partOfSpeech": "v. i.",
"text": "A person appointed to decide in a/trial of skill, speed, etc., between two or more parties; an umpire; as, a judge in a horse race."
},
{
"partOfSpeech": "v. i.",
"text": "One of supreme magistrates, with both civil and military powers, who governed Israel for more than four hundred years."
},
{
"partOfSpeech": "v. i.",
"text": "The title of the seventh book of the Old Testament; the Book of Judges."
},
{
"partOfSpeech": "a.",
"text": "To hear and determine, as in causes on trial; to decide as a judge; to give judgment; to pass sentence."
},
{
"partOfSpeech": "a.",
"text": "To assume the right to pass judgment on another; to sit in judgment or commendation; to criticise or pass adverse judgment upon others. See Judge, v. t., 3."
},
{
"partOfSpeech": "v. t.",
"text": "To compare facts or ideas, and perceive their relations and attributes, and thus distinguish truth from falsehood; to determine; to discern; to distinguish; to form an opinion about."
},
{
"partOfSpeech": "v. t.",
"text": "To hear and determine by authority, as a case before a court, or a controversy between two parties."
},
{
"partOfSpeech": "v. t.",
"text": "To examine and pass sentence on; to try; to doom."
},
{
"partOfSpeech": "v. t.",
"text": "To arrogate judicial authority over; to sit in judgment upon; to be censorious toward."
},
{
"partOfSpeech": "v. t.",
"text": "To determine upon or deliberation; to esteem; to think; to reckon."
},
{
"partOfSpeech": "v. t.",
"text": "To exercise the functions of a magistrate over; to govern."
}
],
"judged": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Judge"
}
],
"judging": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Judge"
}
],
"judger": [
{
"partOfSpeech": "n.",
"text": "One who judges."
}
],
"judgeship": [
{
"partOfSpeech": "n.",
"text": "The office of a judge."
}
],
"judgment": [
{
"partOfSpeech": "v. i.",
"text": "The act of judging; the operation of the mind, involving comparison and discrimination, by which a knowledge of the values and relations of thins, whether of moral qualities, intellectual concepts, logical propositions, or material facts, is obtained; as, by careful judgment he avoided the peril; by a series of wrong judgments he forfeited confidence."
},
{
"partOfSpeech": "v. i.",
"text": "The power or faculty of performing such operationssee 1); esp., when unqualified, the faculty of judging or deciding rightly, justly, or wisely; good sense; as, a man of judgment; a politician without judgment."
},
{
"partOfSpeech": "v. i.",
"text": "The conclusion or result of judging; an opinion; a decision."
},
{
"partOfSpeech": "v. i.",
"text": "The act of determining, as in courts of law, what is conformable to law and justice; also, the determination, decision, or sentence of a court, or of a judge; the mandate or sentence of God as the judge of all."
},
{
"partOfSpeech": "v. i.",
"text": "That act of the mind by which two notions or ideas which are apprehended as distinct are compared for the purpose of ascertaining their agreement or disagreement. See 1. The comparison may be threefold:1) Of individual objects forming a concept.2) Of concepts giving what is technically called a judgment.3) Of two judgments giving an inference. Judgments have been further classed as analytic, synthetic, and identical."
},
{
"partOfSpeech": "v. i.",
"text": "That power or faculty by which knowledge dependent upon comparison and discrimination is acquired. See 2."
},
{
"partOfSpeech": "v. i.",
"text": "A calamity regarded as sent by God, by way of recompense for wrong committed; a providential punishment."
},
{
"partOfSpeech": "v. i.",
"text": "The final award; the last sentence."
}
],
"judicable": [
{
"partOfSpeech": "v. i.",
"text": "Capable of being judged; capable of being tried or decided upon."
}
],
"judicative": [
{
"partOfSpeech": "a.",
"text": "Having power to judge; judicial; as, the judicative faculty."
}
],
"judicatory": [
{
"partOfSpeech": "a.",
"text": "Pertaining to the administration of justice; dispensing justice; judicial; as, judicatory tribunals."
},
{
"partOfSpeech": "n.",
"text": "A court of justice; a tribunal."
},
{
"partOfSpeech": "n.",
"text": "Administration of justice."
}
],
"judicature": [
{
"partOfSpeech": "n.",
"text": "The state or profession of those employed in the administration of justice; also, the dispensing or administration of justice."
},
{
"partOfSpeech": "n.",
"text": "A court of justice; a judicatory."
},
{
"partOfSpeech": "n.",
"text": "The right of judicial action; jurisdiction; extent jurisdiction of a judge or court."
}
],
"judicial": [
{
"partOfSpeech": "a.",
"text": "Pertaining or appropriate to courts of justice, or to a judge; practiced or conformed to in the administration of justice; sanctioned or ordered by a court; as, judicial power; judicial proceedings; a judicial sale."
},
{
"partOfSpeech": "a.",
"text": "Fitted or apt for judging or deciding; as, a judicial mind."
},
{
"partOfSpeech": "a.",
"text": "Belonging to the judiciary, as distinguished from legislative, administrative, or executive. See Executive."
},
{
"partOfSpeech": "a.",
"text": "Judicious."
}
],
"judicially": [
{
"partOfSpeech": "adv.",
"text": "In a judicial capacity or judicial manner."
}
],
"judiciary": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to courts of judicature, or legal tribunals; judicial; as, a judiciary proceeding."
},
{
"partOfSpeech": "n.",
"text": "That branch of government in which judicial power is vested; the system of courts of justice in a country; the judges, taken collectively; as, an independent judiciary; the senate committee on the judiciary."
}
],
"judicious": [
{
"partOfSpeech": "a.",
"text": "Of or relating to a court; judicial."
},
{
"partOfSpeech": "a.",
"text": "Directed or governed by sound judgment; having sound judgment; wise; prudent; sagacious; discreet."
}
],
"judiciously": [
{
"partOfSpeech": "adv.",
"text": "In a judicious manner; with good judgment; wisely."
}
],
"judiciousness": [
{
"partOfSpeech": "n.",
"text": "The quality or state of being judicious; sagacity; sound judgment."
}
],
"jug": [
{
"partOfSpeech": "n.",
"text": "A vessel, usually of coarse earthenware, with a swelling belly and narrow mouth, and having a handle on one side."
},
{
"partOfSpeech": "n.",
"text": "A pitcher; a ewer."
},
{
"partOfSpeech": "n.",
"text": "A prison; a jail; a lockup."
},
{
"partOfSpeech": "v. t.",
"text": "To seethe or stew, as in a jug or jar placed in boiling water; as, to jug a hare."
},
{
"partOfSpeech": "v. t.",
"text": "To commit to jail; to imprison."
},
{
"partOfSpeech": "v. i.",
"text": "To utter a sound resembling this word, as certain birds do, especially the nightingale."
},
{
"partOfSpeech": "v. i.",
"text": "To nestle or collect together in a covey; -- said of quails and partridges."
}
],
"jugged": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jug"
}
],
"jugging": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jug"
}
],
"jugal": [
{
"partOfSpeech": "a.",
"text": "Relating to a yoke, or to marriage."
},
{
"partOfSpeech": "a.",
"text": "Pertaining to, or in the region of, the malar, or cheek bone."
}
],
"jugata": [
{
"partOfSpeech": "n. pl.",
"text": "The figures of two heads on a medal or coin, either side by side or joined."
}
],
"jugated": [
{
"partOfSpeech": "a.",
"text": "Coupled together."
}
],
"juge": [
{
"partOfSpeech": "n.",
"text": "A judge."
}
],
"jugement": [
{
"partOfSpeech": "n.",
"text": "Judgment."
}
],
"juger": [
{
"partOfSpeech": "n.",
"text": "A Roman measure of land, measuring 28,800 square feet, or 240 feet in length by 120 in breadth."
}
],
"jugger": [
{
"partOfSpeech": "n.",
"text": "An East Indian falcon. See Lugger."
}
],
"juggernaut": [
{
"partOfSpeech": "n.",
"text": "One of the names under which Vishnu, in his incarnation as Krishna, is worshiped by the Hindoos."
},
{
"partOfSpeech": "",
"text": "A particular form of Vishnu, or of Krishna, whose chief idol and worship are at Puri, in Orissa. The idol is considered to contain the bones of Krishna and to possess a soul. The principal festivals are the Snanayatra, when the idol is bathed, and the Rathayatra, when the image is drawn upon a car adorned with obscene paintings. Formerly it was erroneously supposed that devotees allowed themselves to be crushed beneath the wheels of this car. It is now known that any death within the temple of Jagannath is considered to render the place unclean, and any spilling of blood in the presence of the idol is a pollution."
}
],
"juggled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Juggle"
}
],
"juggling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Juggle"
},
{
"partOfSpeech": "a.",
"text": "Cheating; tricky."
},
{
"partOfSpeech": "n.",
"text": "Jugglery; underhand practice."
}
],
"juggle": [
{
"partOfSpeech": "v. i.",
"text": "To play tricks by sleight of hand; to cause amusement and sport by tricks of skill; to conjure."
},
{
"partOfSpeech": "v. i.",
"text": "To practice artifice or imposture."
},
{
"partOfSpeech": "v. t.",
"text": "To deceive by trick or artifice."
},
{
"partOfSpeech": "n.",
"text": "A trick by sleight of hand."
},
{
"partOfSpeech": "n.",
"text": "An imposture; a deception."
},
{
"partOfSpeech": "n.",
"text": "A block of timber cut to a length, either in the round or split."
}
],
"juggler": [
{
"partOfSpeech": "n.",
"text": "One who practices or exhibits tricks by sleight of hand; one skilled in legerdemain; a conjurer."
},
{
"partOfSpeech": "n.",
"text": "A deceiver; a cheat."
}
],
"juggleress": [
{
"partOfSpeech": "n.",
"text": "A female juggler."
}
],
"jugglery": [
{
"partOfSpeech": "n.",
"text": "The art or act of a juggler; sleight of hand."
},
{
"partOfSpeech": "n.",
"text": "Trickery; imposture; as, political jugglery."
}
],
"juggs": [
{
"partOfSpeech": "n. pl.",
"text": "See Jougs."
}
],
"juglandin": [
{
"partOfSpeech": "n.",
"text": "An extractive matter contained in the juice of the green shucks of the walnutJuglans regia). It is used medicinally as an alterative, and also as a black hair dye."
}
],
"juglandine": [
{
"partOfSpeech": "n.",
"text": "An alkaloid found in the leaves of the walnutJuglans regia)."
}
],
"juglans": [
{
"partOfSpeech": "n.",
"text": "A genus of valuable trees, including the true walnut of Europe, and the America black walnut, and butternut."
}
],
"juglone": [
{
"partOfSpeech": "n.",
"text": "A yellow crystalline substance resembling quinone, extracted from green shucks of the walnutJuglans regia); -- called also nucin."
}
],
"jugular": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the throat or neck; as, the jugular vein."
},
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the jugular vein; as, the jugular foramen."
},
{
"partOfSpeech": "a.",
"text": "Having the ventral fins beneath the throat; -- said of certain fishes."
},
{
"partOfSpeech": "a.",
"text": "One of the large veins which return the blood from the head to the heart through two chief trunks, an external and an internal, on each side of the neck; -- called also the jugular vein."
},
{
"partOfSpeech": "a.",
"text": "Any fish which has the ventral fins situated forward of the pectoral fins, or beneath the throat; one of a division of fishesJugulares)."
}
],
"jugulated": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jugulate"
}
],
"jugulating": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jugulate"
}
],
"jugulate": [
{
"partOfSpeech": "v. t.",
"text": "To cut the throat of."
}
],
"jugula": [
{
"partOfSpeech": "pl. ",
"text": "of Jugulum"
}
],
"jugulum": [
{
"partOfSpeech": "n.",
"text": "The lower throat, or that part of the neck just above the breast."
}
],
"juga": [
{
"partOfSpeech": "pl. ",
"text": "of Jugum"
}
],
"jugums": [
{
"partOfSpeech": "pl. ",
"text": "of Jugum"
}
],
"jugum": [
{
"partOfSpeech": "n.",
"text": "One of the ridges commonly found on the fruit of umbelliferous plants."
},
{
"partOfSpeech": "n.",
"text": "A pair of the opposite leaflets of a pinnate plant."
}
],
"juice": [
{
"partOfSpeech": "n.",
"text": "The characteristic fluid of any vegetable or animal substance; the sap or part which can be expressed from fruit, etc.; the fluid part which separates from meat in cooking."
},
{
"partOfSpeech": "v. t.",
"text": "To moisten; to wet."
}
],
"juiceless": [
{
"partOfSpeech": "a.",
"text": "Lacking juice; dry."
}
],
"juiciness": [
{
"partOfSpeech": "n.",
"text": "The state or quality of being juicy; succulence plants."
}
],
"juicy": [
{
"partOfSpeech": "superl.",
"text": "A bounding with juice; succulent."
}
],
"juise": [
{
"partOfSpeech": "n.",
"text": "Judgment; justice; sentence."
}
],
"jujube": [
{
"partOfSpeech": "n.",
"text": "The sweet and edible drupesfruits) of several Mediterranean and African species of small trees, of the genus Zizyphus, especially the Z. jujuba, Z. vulgaris, Z. mucronata, and Z. Lotus. The last named is thought to have furnished the lotus of the ancient Libyan Lotophagi, or lotus eaters."
},
{
"partOfSpeech": "n.",
"text": "A lozenge made of or in imitation of, or flavored with, the jujube fruit."
}
],
"juke": [
{
"partOfSpeech": "v. i.",
"text": "To bend the neck; to bow or duck the head."
},
{
"partOfSpeech": "n.",
"text": "The neck of a bird."
},
{
"partOfSpeech": "v. i.",
"text": "To perch on anything, as birds do."
}
],
"julaceous": [
{
"partOfSpeech": "a.",
"text": "Like an ament, or bearing aments; amentaceous."
}
],
"julep": [
{
"partOfSpeech": "n.",
"text": "A refreshing drink flavored with aromatic herbs"
},
{
"partOfSpeech": "n.",
"text": "a sweet, demulcent, acidulous, or mucilaginous mixture, used as a vehicle."
},
{
"partOfSpeech": "n.",
"text": "A beverage composed of brandy, whisky, or some other spirituous liquor, with sugar, pounded ice, and sprigs of mint; -- called also mint julep."
}
],
"julian": [
{
"partOfSpeech": "a.",
"text": "Relating to, or derived from, Julius Caesar."
}
],
"julienne": [
{
"partOfSpeech": "n.",
"text": "A kind of soup containing thin slices or shreds of carrots, onions, etc."
}
],
"juliform": [
{
"partOfSpeech": "a.",
"text": "Having the shape or appearance of a julus or catkin."
}
],
"juli": [
{
"partOfSpeech": "pl. ",
"text": "of Julus"
}
],
"julus": [
{
"partOfSpeech": "n.",
"text": "A catkin or ament. See Ament."
}
],
"julies": [
{
"partOfSpeech": "pl. ",
"text": "of July"
}
],
"july": [
{
"partOfSpeech": "n.",
"text": "The seventh month of the year, containing thirty-one days."
}
],
"july-flower": [
{
"partOfSpeech": "n.",
"text": "See Gillyflower."
}
],
"jumart": [
{
"partOfSpeech": "n.",
"text": "The fabled offspring of a bull and a mare."
}
],
"jumbled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jumble"
}
],
"jumbling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jumble"
}
],
"jumble": [
{
"partOfSpeech": "v. t.",
"text": "To mix in a confused mass; to put or throw together without order; -- often followed by together or up."
},
{
"partOfSpeech": "v. i.",
"text": "To meet or unite in a confused way; to mix confusedly."
},
{
"partOfSpeech": "n.",
"text": "A confused mixture; a mass or collection without order; as, a jumble of words."
},
{
"partOfSpeech": "n.",
"text": "A small, thin, sugared cake, usually ring-shaped."
}
],
"jumblement": [
{
"partOfSpeech": "n.",
"text": "Confused mixture."
}
],
"jumbler": [
{
"partOfSpeech": "n.",
"text": "One who confuses things."
}
],
"jumblingly": [
{
"partOfSpeech": "adv.",
"text": "In a confused manner."
}
],
"jument": [
{
"partOfSpeech": "n.",
"text": "A beast; especially, a beast of burden."
}
],
"jump": [
{
"partOfSpeech": "n.",
"text": "A kind of loose jacket for men."
},
{
"partOfSpeech": "n.",
"text": "A bodice worn instead of stays by women in the 18th century."
},
{
"partOfSpeech": "v. i.",
"text": "To spring free from the ground by the muscular action of the feet and legs; to project one's self through the air; to spring; to bound; to leap."
},
{
"partOfSpeech": "v. i.",
"text": "To move as if by jumping; to bounce; to jolt."
},
{
"partOfSpeech": "v. i.",
"text": "To coincide; to agree; to accord; to tally; -- followed by with."
},
{
"partOfSpeech": "v. t.",
"text": "To pass by a spring or leap; to overleap; as, to jump a stream."
},
{
"partOfSpeech": "v. t.",
"text": "To cause to jump; as, he jumped his horse across the ditch."
},
{
"partOfSpeech": "v. t.",
"text": "To expose to danger; to risk; to hazard."
},
{
"partOfSpeech": "v. t.",
"text": "To join by a butt weld."
},
{
"partOfSpeech": "v. t.",
"text": "To thicken or enlarge by endwise blows; to upset."
},
{
"partOfSpeech": "v. t.",
"text": "To bore with a jumper."
},
{
"partOfSpeech": "n.",
"text": "The act of jumping; a leap; a spring; a bound."
},
{
"partOfSpeech": "n.",
"text": "An effort; an attempt; a venture."
},
{
"partOfSpeech": "n.",
"text": "The space traversed by a leap."
},
{
"partOfSpeech": "n.",
"text": "A dislocation in a stratum; a fault."
},
{
"partOfSpeech": "n.",
"text": "An abrupt interruption of level in a piece of brickwork or masonry."
},
{
"partOfSpeech": "a.",
"text": "Nice; exact; matched; fitting; precise."
},
{
"partOfSpeech": "adv.",
"text": "Exactly; pat."
}
],
"jumped": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jump"
}
],
"jumping": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jump"
},
{
"partOfSpeech": "p. a. & vb. n.",
"text": "of Jump, to leap."
}
],
"jumper": [
{
"partOfSpeech": "n.",
"text": "One who, or that which, jumps."
},
{
"partOfSpeech": "n.",
"text": "A long drilling tool used by masons and quarrymen."
},
{
"partOfSpeech": "n.",
"text": "A rude kind of sleigh; -- usually, a simple box on runners which are in one piece with the poles that form the thills."
},
{
"partOfSpeech": "n.",
"text": "The larva of the cheese fly. See Cheese fly, under Cheese."
},
{
"partOfSpeech": "n.",
"text": "A name applied in the 18th century to certain Calvinistic Methodists in Wales whose worship was characterized by violent convulsions."
},
{
"partOfSpeech": "n.",
"text": "spring to impel the star wheel, also a pawl to lock fast a wheel, in a repeating timepiece."
},
{
"partOfSpeech": "n.",
"text": "A loose upper garment"
},
{
"partOfSpeech": "n.",
"text": "A sort of blouse worn by workmen over their ordinary dress to protect it."
},
{
"partOfSpeech": "n.",
"text": "A fur garment worn in Arctic journeys."
},
{
"partOfSpeech": "n.",
"text": "A thing that jumps; esp., any of various tools or other contrivances operating with a jumping motion;"
},
{
"partOfSpeech": "n.",
"text": "an instrument for boring holes in rocks by percussion without hammering, consisting of a bar of iron with a chisel-edged steel tip at one or both ends, operated by striking it against the rock, turning it slightly with each blow."
}
],
"jumpweld": [
{
"partOfSpeech": "v. t.",
"text": "See Buttweld, v. t."
}
],
"juncaceous": [
{
"partOfSpeech": "a.",
"text": "Of. pertaining to, or resembling, a natural order of plantsJuncaceae), of which the common rushJuncus) is the type."
}
],
"juncate": [
{
"partOfSpeech": "n.",
"text": "See Junket."
}
],
"juncite": [
{
"partOfSpeech": "n.",
"text": "A fossil rush."
}
],
"junco": [
{
"partOfSpeech": "n.",
"text": "Any bird of the genus Junco, which includes several species of North American finches; -- called also snowbird, or blue snowbird."
}
],
"juncous": [
{
"partOfSpeech": "a.",
"text": "Full of rushes: resembling rushes; juncaceous."
}
],
"junction": [
{
"partOfSpeech": "n.",
"text": "The act of joining, or the state of being joined; union; combination; coalition; as, the junction of two armies or detachments; the junction of paths."
},
{
"partOfSpeech": "n.",
"text": "The place or point of union, meeting, or junction; specifically, the place where two or more lines of railway meet or cross."
}
],
"juncture": [
{
"partOfSpeech": "n.",
"text": "A joining; a union; an alliance."
},
{
"partOfSpeech": "n.",
"text": "The line or point at which two bodies are joined; a joint; an articulation; a seam; as, the junctures of a vessel or of the bones."
},
{
"partOfSpeech": "n.",
"text": "A point of time; esp., one made critical or important by a concurrence of circumstances; hence, a crisis; an exigency."
}
],
"june": [
{
"partOfSpeech": "n.",
"text": "The sixth month of the year, containing thirty days."
},
{
"partOfSpeech": "n.",
"text": "The sister and wife of Jupiter, the queen of heaven, and the goddess who presided over marriage. She corresponds to the Greek Hera."
},
{
"partOfSpeech": "n.",
"text": "One of the early discovered asteroids."
}
],
"juneating": [
{
"partOfSpeech": "n.",
"text": "A kind of early apple."
}
],
"juneberry": [
{
"partOfSpeech": "n.",
"text": "The small applelike berry of American trees of genus Amelanchier; -- also called service berry."
},
{
"partOfSpeech": "n.",
"text": "The shrub or tree which bears this fruit; -- also called shad bush, and had tree."
}
],
"jungermanniae": [
{
"partOfSpeech": "pl. ",
"text": "of Jungermannia"
}
],
"jungermannia": [
{
"partOfSpeech": "n.",
"text": "A genus of hepatic mosses, now much circumscribed, but formerly comprising most plants of the order, which is sometimes therefore called Jungermanniaceae."
}
],
"jungle": [
{
"partOfSpeech": "n.",
"text": "A dense growth of brushwood, grasses, reeds, vines, etc.; an almost impenetrable thicket of trees, canes, and reedy vegetation, as in India, Africa, Australia, and Brazil."
}
],
"jungly": [
{
"partOfSpeech": "a.",
"text": "Consisting of jungles; abounding with jungles; of the nature of a jungle."
}
],
"junior": [
{
"partOfSpeech": "a.",
"text": "Less advanced in age than another; younger."
},
{
"partOfSpeech": "a.",
"text": "Lower in standing or in rank; later in office; as, a junior partner; junior counsel; junior captain."
},
{
"partOfSpeech": "a.",
"text": "Composed of juniors, whether younger or a lower standing; as, the junior class; of or pertaining to juniors or to a junior class. See Junior, n., 2."
},
{
"partOfSpeech": "n.",
"text": "Belonging to a younger person, or an earlier time of life."
},
{
"partOfSpeech": "n.",
"text": "A younger person."
},
{
"partOfSpeech": "n.",
"text": "Hence: One of a lower or later standing; specifically, in American colleges, one in the third year of his course, one in the fourth or final year being designated a senior; in some seminaries, one in the first year, in others, one in the second year, of a three years' course."
}
],
"juniority": [
{
"partOfSpeech": "n.",
"text": "The state or quality of being junior."
}
],
"juniper": [
{
"partOfSpeech": "n.",
"text": "Any evergreen shrub or tree, of the genus Juniperus and order Coniferae."
}
],
"juniperin": [
{
"partOfSpeech": "n.",
"text": "A yellow amorphous substance extracted from juniper berries."
}
],
"juniperite": [
{
"partOfSpeech": "n.",
"text": "One of the fossil Coniferae, evidently allied to the juniper."
}
],
"junk": [
{
"partOfSpeech": "n.",
"text": "A fragment of any solid substance; a thick piece. See Chunk."
},
{
"partOfSpeech": "n.",
"text": "Pieces of old cable or old cordage, used for making gaskets, mats, swabs, etc., and when picked to pieces, forming oakum for filling the seams of ships."
},
{
"partOfSpeech": "n.",
"text": "Old iron, or other metal, glass, paper, etc., bought and sold by junk dealers."
},
{
"partOfSpeech": "n.",
"text": "Hard salted beef supplied to ships."
},
{
"partOfSpeech": "n.",
"text": "A large vessel, without keel or prominent stem, and with huge masts in one piece, used by the Chinese, Japanese, Siamese, Malays, etc., in navigating their waters."
}
],
"junker": [
{
"partOfSpeech": "n.",
"text": "A young German noble or squire; esp., a member of the aristocratic party in Prussia."
}
],
"junkerism": [
{
"partOfSpeech": "n.",
"text": "The principles of the aristocratic party in Prussia."
}
],
"junket": [
{
"partOfSpeech": "n.",
"text": "A cheese cake; a sweetmeat; any delicate food."
},
{
"partOfSpeech": "n.",
"text": "A feast; an entertainment."
},
{
"partOfSpeech": "v. i.",
"text": "To feast; to banquet; to make an entertainment; -- sometimes applied opprobriously to feasting by public officers at the public cost."
},
{
"partOfSpeech": "v. t.",
"text": "To give entertainment to; to feast."
}
],
"junketed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Junket"
}
],
"junketing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Junket"
},
{
"partOfSpeech": "n.",
"text": "A feast or entertainment; a revel."
}
],
"junketries": [
{
"partOfSpeech": "n. pl.",
"text": "Sweetmeats."
}
],
"junos": [
{
"partOfSpeech": "pl. ",
"text": "of June"
}
],
"juntas": [
{
"partOfSpeech": "pl. ",
"text": "of Junta"
}
],
"junta": [
{
"partOfSpeech": "n.",
"text": "A council; a convention; a tribunal; an assembly; esp., the grand council of state in Spain."
}
],
"juntos": [
{
"partOfSpeech": "pl. ",
"text": "of Junto"
}
],
"junto": [
{
"partOfSpeech": "n.",
"text": "A secret council to deliberate on affairs of government or politics; a number of men combined for party intrigue; a faction; a cabal; as, a junto of ministers; a junto of politicians."
}
],
"junartie": [
{
"partOfSpeech": "n.",
"text": "Jeopardy."
}
],
"jupati palm": [
{
"partOfSpeech": "",
"text": "A great Brazilian palm treeRaphia taedigera), used by the natives for many purposes."
}
],
"jupe": [
{
"partOfSpeech": "n.",
"text": "Same as Jupon."
}
],
"jupiter": [
{
"partOfSpeech": "n.",
"text": "The supreme deity, king of gods and men, and reputed to be the son of Saturn and Rhea; Jove. He corresponds to the Greek Zeus."
},
{
"partOfSpeech": "n.",
"text": "One of the planets, being the brightest except Venus, and the largest of them all, its mean diameter being about 85,000 miles. It revolves about the sun in 4,332.6 days, at a mean distance of 5.2028 from the sun, the earth's mean distance being taken as unity."
}
],
"jupon": [
{
"partOfSpeech": "n.",
"text": "Alt. of Juppon"
}
],
"juppon": [
{
"partOfSpeech": "n.",
"text": "A sleeveless jacket worn over the armor in the 14th century. It fitted closely, and descended below the hips."
},
{
"partOfSpeech": "n.",
"text": "A petticoat."
}
],
"jura": [
{
"partOfSpeech": "n.",
"text": "1. A range of mountains between France and Switzerland."
},
{
"partOfSpeech": "n.",
"text": "The Jurassic period. See Jurassic."
}
],
"jural": [
{
"partOfSpeech": "a.",
"text": "Pertaining to natural or positive right."
},
{
"partOfSpeech": "a.",
"text": "Of or pertaining to jurisprudence."
}
],
"juramenta": [
{
"partOfSpeech": "pl. ",
"text": "of Juramentum"
}
],
"juramentum": [
{
"partOfSpeech": "n.",
"text": "An oath."
}
],
"jurassic": [
{
"partOfSpeech": "a.",
"text": "Of the age of the middle Mesozoic, including, as divided in England and Europe, the Lias, Oolite, and Wealden; -- named from certain rocks of the Jura mountains."
},
{
"partOfSpeech": "n.",
"text": "The Jurassic period or formation; -- called also the Jura."
}
],
"jurat": [
{
"partOfSpeech": "n.",
"text": "A person under oath; specifically, an officer of the nature of an alderman, in certain municipal corporations in England."
},
{
"partOfSpeech": "n.",
"text": "The memorandum or certificate at the end of an asffidavit, or a bill or answer in chancery, showing when, before whom, andin English practice), where, it was sworn or affirmed."
}
],
"juratory": [
{
"partOfSpeech": "a.",
"text": "Relating to or comprising an oath; as, juratory caution."
}
],
"jura-trias": [
{
"partOfSpeech": "n.",
"text": "A term applied to many American Mesozoic strata, in which the characteristics of the Jurassic and Triassic periods appear to be blended."
}
],
"jurdiccion": [
{
"partOfSpeech": "n.",
"text": "Jurisdiction."
}
],
"jurdon": [
{
"partOfSpeech": "n.",
"text": "Jordan."
}
],
"jurel": [
{
"partOfSpeech": "n.",
"text": "A yellow carangoid fish of the Atlantic and Gulf coastsCaranx chrysos), most abundant southward, where it is valued as a food fish; -- called also hardtail, horse crevalle, jack, buffalo jack, skipjack, yellow mackerel, and sometimes, improperly, horse mackerel. Other species of Caranxas C. fallax) are also sometimes called jurel."
}
],
"juridic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Juridical"
}
],
"juridical": [
{
"partOfSpeech": "a.",
"text": "Pertaining to a judge or to jurisprudence; acting in the distribution of justice; used in courts of law; according to law; legal; as, juridical law."
}
],
"juridically": [
{
"partOfSpeech": "adv.",
"text": "In a juridical manner."
}
],
"jurisconsult": [
{
"partOfSpeech": "n.",
"text": "A man learned in the civil law; an expert in juridical science; a professor of jurisprudence; a jurist."
}
],
"jurisdiction": [
{
"partOfSpeech": "a.",
"text": "The legal power, right, or authority of a particular court to hear and determine causes, to try criminals, or to execute justice; judicial authority over a cause or class of causes; as, certain suits or actions, or the cognizance of certain crimes, are within the jurisdiction of a particular court, that is, within the limits of its authority or commission."
},
{
"partOfSpeech": "a.",
"text": "The authority of a sovereign power to govern or legislate; the right of making or enforcing laws; the power or right of exercising authority."
},
{
"partOfSpeech": "a.",
"text": "Sphere of authority; the limits within which any particular power may be exercised, or within which a government or a court has authority."
}
],
"jurisdictional": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to jurisdiction; as jurisdictional rights."
}
],
"jurisdictive": [
{
"partOfSpeech": "a.",
"text": "Having jurisdiction."
}
],
"jurisprudence": [
{
"partOfSpeech": "a.",
"text": "The science of juridical law; the knowledge of the laws, customs, and rights of men in a state or community, necessary for the due administration of justice."
}
],
"jurisprudent": [
{
"partOfSpeech": "a.",
"text": "Understanding law; skilled in jurisprudence."
},
{
"partOfSpeech": "n.",
"text": "One skilled in law or jurisprudence."
}
],
"jurisprudential": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to jurisprudence."
}
],
"jurist": [
{
"partOfSpeech": "a.",
"text": "One who professes the science of law; one versed in the law, especially in the civil law; a writer on civil and international law."
}
],
"juristic": [
{
"partOfSpeech": "a.",
"text": "Alt. of Juristical"
}
],
"juristical": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to a jurist, to the legal profession, or to jurisprudence."
}
],
"juror": [
{
"partOfSpeech": "n.",
"text": "A member of a jury; a juryman."
},
{
"partOfSpeech": "n.",
"text": "A member of any jury for awarding prizes, etc."
}
],
"jury": [
{
"partOfSpeech": "a.",
"text": "For temporary use; -- applied to a temporary contrivance."
},
{
"partOfSpeech": "a.",
"text": "A body of men, usually twelve, selected according to law, impaneled and sworn to inquire into and try any matter of fact, and to render their true verdict according to the evidence legally adduced. See Grand jury under Grand, and Inquest."
},
{
"partOfSpeech": "a.",
"text": "A committee for determining relative merit or awarding prizes at an exhibition or competition; as, the art jury gave him the first prize."
}
],
"juries": [
{
"partOfSpeech": "pl. ",
"text": "of Jury"
}
],
"jurymen": [
{
"partOfSpeech": "pl. ",
"text": "of Juryman"
}
],
"juryman": [
{
"partOfSpeech": "n.",
"text": "One who is impaneled on a jury, or who serves as a juror."
}
],
"jury-rigged": [
{
"partOfSpeech": "a.",
"text": "Rigged for temporary service. See Jury, a."
},
{
"partOfSpeech": "a.",
"text": "Rigged for temporary service."
}
],
"jussi": [
{
"partOfSpeech": "n.",
"text": "A delicate fiber, produced in the Philippine Islands from an unidentified plant, of which dresses, etc., are made."
}
],
"just": [
{
"partOfSpeech": "a.",
"text": "Conforming or conformable to rectitude or justice; not doing wrong to any; violating no right or obligation; upright; righteous; honest; true; -- said both of persons and things."
},
{
"partOfSpeech": "a.",
"text": "Not transgressing the requirement of truth and propriety; conformed to the truth of things, to reason, or to a proper standard; exact; normal; reasonable; regular; due; as, a just statement; a just inference."
},
{
"partOfSpeech": "a.",
"text": "Rendering or disposed to render to each one his due; equitable; fair; impartial; as, just judge."
},
{
"partOfSpeech": "adv.",
"text": "Precisely; exactly; -- in place, time, or degree; neither more nor less than is stated."
},
{
"partOfSpeech": "adv.",
"text": "Closely; nearly; almost."
},
{
"partOfSpeech": "adv.",
"text": "Barely; merely; scarcely; only; by a very small space or time; as, he just missed the train; just too late."
},
{
"partOfSpeech": "v. i.",
"text": "To joust."
},
{
"partOfSpeech": "n.",
"text": "A joust."
}
],
"justice": [
{
"partOfSpeech": "a.",
"text": "The quality of being just; conformity to the principles of righteousness and rectitude in all things; strict performance of moral obligations; practical conformity to human or divine law; integrity in the dealings of men with each other; rectitude; equity; uprightness."
},
{
"partOfSpeech": "a.",
"text": "Conformity to truth and reality in expressing opinions and in conduct; fair representation of facts respecting merit or demerit; honesty; fidelity; impartiality; as, the justice of a description or of a judgment; historical justice."
},
{
"partOfSpeech": "a.",
"text": "The rendering to every one his due or right; just treatment; requital of desert; merited reward or punishment; that which is due to one's conduct or motives."
},
{
"partOfSpeech": "a.",
"text": "Agreeableness to right; equity; justness; as, the justice of a claim."
},
{
"partOfSpeech": "a.",
"text": "A person duly commissioned to hold courts, or to try and decide controversies and administer justice."
},
{
"partOfSpeech": "v. t.",
"text": "To administer justice to."
}
],
"justiceable": [
{
"partOfSpeech": "a.",
"text": "Liable to trial in a court of justice."
}
],
"justicehood": [
{
"partOfSpeech": "n.",
"text": "Justiceship."
}
],
"justicement": [
{
"partOfSpeech": "n.",
"text": "Administration of justice; procedure in courts of justice."
}
],
"justicer": [
{
"partOfSpeech": "n.",
"text": "One who administers justice; a judge."
}
],
"justiceship": [
{
"partOfSpeech": "n.",
"text": "The office or dignity of a justice."
}
],
"justiciable": [
{
"partOfSpeech": "a.",
"text": "Proper to be examined in a court of justice."
}
],
"justiciar": [
{
"partOfSpeech": "n.",
"text": "Same as Justiciary."
}
],
"justiciary": [
{
"partOfSpeech": "n.",
"text": "An old name for the judges of the higher English courts."
}
],
"justico": [
{
"partOfSpeech": "n.",
"text": "Alt. of Justicoat"
}
],
"justicoat": [
{
"partOfSpeech": "n.",
"text": "Formerly, a close coat or waistcoat with sleeves."
}
],
"justifiable": [
{
"partOfSpeech": "a.",
"text": "Capable of being justified, or shown to be just."
}
],
"justification": [
{
"partOfSpeech": "n.",
"text": "The act of justifying or the state of being justified; a showing or proving to be just or conformable to law, justice, right, or duty; defense; vindication; support; as, arguments in justification of the prisoner's conduct; his disobedience admits justification."
},
{
"partOfSpeech": "n.",
"text": "The showing in court of a sufficient lawful reason why a party charged or accused did that for which he is called to answer."
},
{
"partOfSpeech": "n.",
"text": "The act of justifying, or the state of being justified, in respect to God's requirements."
},
{
"partOfSpeech": "n.",
"text": "Adjustment of type by spacing it so as to make it exactly fill a line, or of a cut so as to hold it in the right place; also, the leads, quads, etc., used for making such adjustment."
}
],
"justificative": [
{
"partOfSpeech": "a.",
"text": "Having power to justify; justificatory."
}
],
"justificator": [
{
"partOfSpeech": "n.",
"text": "One who justifies or vindicates; a justifier."
}
],
"justificatory": [
{
"partOfSpeech": "a.",
"text": "Vindicatory; defensory; justificative."
}
],
"justifier": [
{
"partOfSpeech": "n.",
"text": "One who justifies; one who vindicates, supports, defends, or absolves."
}
],
"justified": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Justify"
}
],
"justifying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Justify"
}
],
"justify": [
{
"partOfSpeech": "a.",
"text": "To prove or show to be just; to vindicate; to maintain or defend as conformable to law, right, justice, propriety, or duty."
},
{
"partOfSpeech": "a.",
"text": "To pronounce free from guilt or blame; to declare or prove to have done that which is just, right, proper, etc.; to absolve; to exonerate; to clear."
},
{
"partOfSpeech": "a.",
"text": "To treat as if righteous and just; to pardon; to exculpate; to absolve."
},
{
"partOfSpeech": "a.",
"text": "To prove; to ratify; to confirm."
},
{
"partOfSpeech": "a.",
"text": "To make even or true, as lines of type, by proper spacing; to adjust, as type. See Justification, 4."
},
{
"partOfSpeech": "v. i.",
"text": "To form an even surface or true line with something else; to fit exactly."
},
{
"partOfSpeech": "v. i.",
"text": "To take oath to the ownership of property sufficient to qualify one's self as bail or surety."
},
{
"partOfSpeech": "v. t.",
"text": "To showa person) to have had a sufficient legal reason for an act that has been made the subject of a change or accusation."
},
{
"partOfSpeech": "v. t.",
"text": "To qualifyone's self) as a surely by taking oath to the ownership of sufficient property."
}
],
"justinian": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to the Institutes or laws of the Roman Justinian."
}
],
"justle": [
{
"partOfSpeech": "v. i.",
"text": "To run or strike against each other; to encounter; to clash; to jostle."
},
{
"partOfSpeech": "v. t.",
"text": "To push; to drive; to force by running against; to jostle."
},
{
"partOfSpeech": "n.",
"text": "An encounter or shock; a jostle."
}
],
"justled": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Justle"
}
],
"justling": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Justle"
}
],
"justly": [
{
"partOfSpeech": "a.",
"text": "In a just manner; in conformity to law, justice, or propriety; by right; honestly; fairly; accurately."
}
],
"justness": [
{
"partOfSpeech": "n.",
"text": "The quality of being just; conformity to truth, propriety, accuracy, exactness, and the like; justice; reasonableness; fairness; equity; as, justness of proportions; the justness of a description or representation; the justness of a cause."
}
],
"jutted": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jut"
}
],
"jutting": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jut"
},
{
"partOfSpeech": "a.",
"text": "Projecting, as corbels, cornices, etc."
}
],
"jut": [
{
"partOfSpeech": "v. i.",
"text": "To shoot out or forward; to project beyond the main body; as, the jutting part of a building."
},
{
"partOfSpeech": "v. i.",
"text": "To butt."
},
{
"partOfSpeech": "n.",
"text": "That which projects or juts; a projection."
},
{
"partOfSpeech": "n.",
"text": "A shove; a push."
}
],
"jute": [
{
"partOfSpeech": "n.",
"text": "The coarse, strong fiber of the East Indian Corchorus olitorius, and C. capsularis; also, the plant itself. The fiber is much used for making mats, gunny cloth, cordage, hangings, paper, etc."
}
],
"jutes": [
{
"partOfSpeech": "n. pl.",
"text": "Jutlanders; one of the Low German tribes, a portion of which settled in Kent, England, in the 5th century."
}
],
"jutlander": [
{
"partOfSpeech": "n.",
"text": "A native or inhabitant of Jutland in Denmark."
}
],
"jutlandish": [
{
"partOfSpeech": "a.",
"text": "Of or pertaining to Jutland, or to the people of Jutland."
}
],
"jutty": [
{
"partOfSpeech": "n.",
"text": "A projection in a building; also, a pier or mole; a jetty."
},
{
"partOfSpeech": "v. t. & i.",
"text": "To project beyond."
}
],
"juvenal": [
{
"partOfSpeech": "n.",
"text": "A youth."
}
],
"juvenescence": [
{
"partOfSpeech": "n.",
"text": "A growing young."
}
],
"juvenescent": [
{
"partOfSpeech": "a.",
"text": "Growing or becoming young."
}
],
"juvenile": [
{
"partOfSpeech": "a.",
"text": "Young; youthful; as, a juvenile appearance."
},
{
"partOfSpeech": "a.",
"text": "Of or pertaining to youth; as, juvenile sports."
},
{
"partOfSpeech": "n.",
"text": "A young person or youth; -- used sportively or familiarly."
}
],
"juvenileness": [
{
"partOfSpeech": "n.",
"text": "The state or quality of being juvenile; juvenility."
}
],
"juvenilities": [
{
"partOfSpeech": "pl. ",
"text": "of Juvenility"
}
],
"juvenility": [
{
"partOfSpeech": "n.",
"text": "Youthfulness; adolescence."
},
{
"partOfSpeech": "n.",
"text": "The manners or character of youth; immaturity."
}
],
"juvia": [
{
"partOfSpeech": "n.",
"text": "A Brazilian name for the lofty myrtaceous treeBertholetia excelsa) which produces the large seeds known as Brazil nuts."
}
],
"juwansa": [
{
"partOfSpeech": "n.",
"text": "The camel's thorn. See under Camel."
}
],
"juwise": [
{
"partOfSpeech": "n.",
"text": "Same as Juise."
}
],
"juxtapose": [
{
"partOfSpeech": "v. t.",
"text": "To place in juxtaposition."
}
],
"juxtaposited": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Juxtaposit"
}
],
"juxtapositing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Juxtaposit"
}
],
"juxtaposit": [
{
"partOfSpeech": "v. t.",
"text": "To place in close connection or contiguity; to juxtapose."
}
],
"juxtaposition": [
{
"partOfSpeech": "v. i.",
"text": "A placing or being placed in nearness or contiguity, or side by side; as, a juxtaposition of words."
}
],
"junold": [
{
"partOfSpeech": "a.",
"text": "See Gimmal."
}
],
"jacal": [
{
"partOfSpeech": "n.",
"text": "In Mexico and the south western United States, a kind of plastered house or hut, usually made by planting poles or timber in the geound, filling in between them with screen work or wickerwork, and daubing one or both sides with mud or adobe mortar; also, this method of construction."
}
],
"jackaroo": [
{
"partOfSpeech": "",
"text": "Alt. of Jackeroo"
},
{
"partOfSpeech": "v. i.",
"text": "To be a jackaroo; to pass one's time as a jackaroo."
}
],
"jackeroo": [
{
"partOfSpeech": "",
"text": "A young man living as an apprentice on a sheep station, or otherwise engaged in acquainting himself with colonial life."
}
],
"jackies": [
{
"partOfSpeech": "pl. ",
"text": "of Jacky"
}
],
"jacky": [
{
"partOfSpeech": "n.",
"text": "Dim. or pet from Jack"
},
{
"partOfSpeech": "n.",
"text": "A landsman's nickname for a seaman, resented by the latter."
},
{
"partOfSpeech": "n.",
"text": "English gin."
}
],
"jagannath": [
{
"partOfSpeech": "",
"text": "Alt. of Juggernaut"
}
],
"jagannatha": [
{
"partOfSpeech": "",
"text": "Alt. of Juggernaut"
}
],
"jaggery palm": [
{
"partOfSpeech": "",
"text": "An East Indian palmCaryota urens) having leaves pinnate with wedge-shaped divisions, the petiole very stout. It is the principal source of jaggery, and is often cultivated for ornament."
}
],
"jahvist": [
{
"partOfSpeech": "a.",
"text": "Alt. of Jahvistic"
},
{
"partOfSpeech": "",
"text": "Alt. of Jehovist"
}
],
"jahvistic": [
{
"partOfSpeech": "a.",
"text": "See Jehovist, Jehovistic."
}
],
"jambool": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jambul"
}
],
"jambul": [
{
"partOfSpeech": "n.",
"text": "The Java plum; also, a drug obtained from its bark and seeds, used as a remedy for diabetes."
}
],
"jambooree": [
{
"partOfSpeech": "n.",
"text": "A noisy or unrestrained carousal or frolic; a spree."
}
],
"japan current": [
{
"partOfSpeech": "",
"text": "A branch of the equatorial current of the Pacific, washing the eastern coast of Formosa and thence flowing northeastward past Japan and merging into the easterly drift of the North Pacific; -- called also Kuro-Siwo, or Black Stream, in allusion to the deep blue of its water. It is similar in may ways to the Gulf Stream."
}
],
"japonism": [
{
"partOfSpeech": "n.",
"text": "A quality, idiom, or peculiarity characteristic of the Japanese or their products, esp. in art."
}
],
"jaspe": [
{
"partOfSpeech": "a.",
"text": "Having the surface decorated with cloudings and streaks, somewhat as if imitating jasper."
}
],
"jeffersonian simplicity": [
{
"partOfSpeech": "",
"text": "The absence of pomp or display which Jefferson aimed at in his administration as President1801-1809), eschewing display or ceremony tending to distinguish the President from the people, as in going to the capital on horseback and with no escort, the abolition of court etiquette and the weekly levee, refusal to recognize titles of honor, etc."
}
],
"jellified": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jellify"
}
],
"jellifying": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jellify"
}
],
"jellify": [
{
"partOfSpeech": "v. t. & i.",
"text": "To make, or to become, gelatinous; to jelly."
}
],
"jequirity": [
{
"partOfSpeech": "",
"text": "Alt. of Jequirity bean"
}
],
"jequirity bean": [
{
"partOfSpeech": "",
"text": "The seed of the wild licoriceAbrus precatorius) used by the people of India for beads in rosaries and necklaces, as a standard weight, etc.; -- called also jumble bead."
}
],
"jerry": [
{
"partOfSpeech": "a.",
"text": "Flimsy; jerry-built."
}
],
"jerry-builder": [
{
"partOfSpeech": "n.",
"text": "A professional builder who erects cheap dwellings of poor materials and unsubstantial and slovenly construction."
}
],
"jesu": [
{
"partOfSpeech": "n.",
"text": "Jesus."
}
],
"jeunesse doree": [
{
"partOfSpeech": "",
"text": "Lit., gilded youth; young people of wealth and fashion, esp. if given to prodigal living; -- in the French Revolution, applied to young men of the upper classes who aided in suppressing the Jacobins after the Reign of Terror."
}
],
"jewish calendar": [
{
"partOfSpeech": "",
"text": "A lunisolar calendar in use among Hebraic peoples, reckoning from the year 3761 b. c., the date traditionally given for the Creation."
}
],
"jibbed": [
{
"partOfSpeech": "imp. & p. p.",
"text": "of Jib"
}
],
"jibbing": [
{
"partOfSpeech": "p. pr. & vb. n.",
"text": "of Jib"
}
],
"jibb": [
{
"partOfSpeech": "",
"text": "To shift, or swing round, as a sail, boom, yard, etc., as in tacking."
}
],
"jihad": [
{
"partOfSpeech": "n.",
"text": "Alt. of Jehad"
}
],
"jehad": [
{
"partOfSpeech": "n.",
"text": "A religious war against infidels or Mohammedan heretics; also, any bitter war or crusade for a principle or belief."
}
],
"jim crow": [
{
"partOfSpeech": "",
"text": "A negro; -- said to be so called from a popular negro song and dance, the refrain of which is \"Wheel about and turn about and jump Jim Crow,\" produced in 1835 by T. D. Rice, a famous negro minstrel."
}
],
"jink": [
{
"partOfSpeech": "v. i.",
"text": "To move quickly, esp. with a sudden turn; hence, to dodge; to escape by a quick turn; -- obs. or dial., except as a hunting term in pig-sticking."
},
{
"partOfSpeech": "v. i.",
"text": "In the games of spoilfive and forty-five, to win the game by taking all five tricks; also, to play to win  all five tricks, losing what has been already won if unsuccessful."
}
],
"jinx": [
{
"partOfSpeech": "n.",
"text": "A person, object, influence, or supernatural being which is supposed to bring bad luck or to cause things to go wrong."
}
],
"jollies": [
{
"partOfSpeech": "pl. ",
"text": "of Jolly"
}
],
"joss paper": [
{
"partOfSpeech": "",
"text": "Gold and silver paper burned by the Chinese, in the form of coins or ingots, in worship and at funerals."
}
],
"joulemeter": [
{
"partOfSpeech": "n.",
"text": "An integrating wattmeter for measuring the energy in joules expended in an electric circuit or developed by a machine."
}
],
"joule's cycle": [
{
"partOfSpeech": "",
"text": "The cycle for the air engine proposed by Joule. In it air is taken by a pump from a cold chamber and compressed adiabatically until its pressure is eqal to that of the air in a hot chamber, into which it is then delivered, thereby displacing an equal amount of hot air into the engine cylinder. Here it expands adiabatically to the temperature of the cold chamber into which it is finally exhausted. This cycle, reversed, is used in refrigerating machines."
}
],
"joule's law": [
{
"partOfSpeech": "",
"text": "The law that the rate at which heat is produced in any part of an electric circuit is measured by the product of the square of the current into the resistance of that part of the circuit. If the currenti) is constant for an interval of timet), the energyH) in heat units equals i2Rt, R being resistance."
},
{
"partOfSpeech": "",
"text": "The law that there is no change of temperature when a gas expands without doing external work and without receiving or rejecting heat."
}
],
"jubbah": [
{
"partOfSpeech": "",
"text": "Alt. of Joobbeh"
}
],
"jubbeh": [
{
"partOfSpeech": "",
"text": "Alt. of Joobbeh"
}
],
"joobbeh": [
{
"partOfSpeech": "",
"text": "A long outer garment worn by both sexes of Mohammedans of the better class."
}
],
"judaizers": [
{
"partOfSpeech": "n. pl.",
"text": "See Raskolnik."
}
],
"judge-made": [
{
"partOfSpeech": "a.",
"text": "Created by judges or judicial decision; -- applied esp. to law applied or established by the judicial interpretation of statutes so as extend or restrict their scope, as to meet new cases, to provide new or better remedies, etc., and often used opprobriously of acts judicial interpretation considered doing this."
}
],
"jujutsu": [
{
"partOfSpeech": "",
"text": "Alt. of Jiujitsu"
}
],
"jujitsu": [
{
"partOfSpeech": "",
"text": "Alt. of Jiujitsu"
}
],
"jiujutsu": [
{
"partOfSpeech": "",
"text": "Alt. of Jiujitsu"
}
],
"jiujitsu": [
{
"partOfSpeech": "",
"text": "The Japanese art of self-defense without weapons, now widely used as a system of physical training. It depends for its efficiency largely upon the principle of making use of an opponent's strength and weight to disable or injure him, and by applying pressure so that his opposing movement will throw him out of balance, dislocate or break a joint, etc.  It opposes knowledge and skill to brute strength, and demands an extensive practical knowledge of human anatomy."
}
],
"jukes, the": [
{
"partOfSpeech": "",
"text": "A pseudonym used to designate the descendants of two sisters, the \"Jukes\" sisters, whose husbands were sons of a backwoodsman of Dutch descent. They lived in the State of New York, and their history was investigated by R. L. Dugdale as an example of the inheritance of criminal and immoral tendencies, disease, and pauperism. Sixty per cent of those traced showed, degeneracy, and they are estimated to have cost society $1,308,000 in 75 years."
}
],
"jumelle": [
{
"partOfSpeech": "a.",
"text": "Twin; paired; -- said of various objects made or formed in pairs, as a binocular opera glass, a pair of gimmal rings, etc."
},
{
"partOfSpeech": "n.",
"text": "A jumelle opera glass, or the like."
}
],
"jumping disease": [
{
"partOfSpeech": "",
"text": "A convulsive tic similar to or identical with miryachit, observed among the woodsmen of Maine."
}
],
"jump spark": [
{
"partOfSpeech": "",
"text": "A spark produced by the jumping of electricity across a permanent gap."
}
],
"jumpy": [
{
"partOfSpeech": "superl.",
"text": "Jumping, or inducing to jump; characterized by jumps; hence, extremely nervous."
}
],
"junction box": [
{
"partOfSpeech": "",
"text": "A box through which the main conductors of a system of electric distribution pass, and where connection is made with branch circuits."
}
],
"jury mast": [
{
"partOfSpeech": "",
"text": "A temporary mast, in place of one that has been carried away, or broken."
},
{
"partOfSpeech": "",
"text": "An apparatus to support the trunk and head in spinal disease."
}
],
"jahveh": [
{
"partOfSpeech": "",
"text": "Alt. of Jahve"
}
],
"jahve": [
{
"partOfSpeech": "",
"text": "A modern transliteration of the Hebrew word translated Jehovah in the Bible; -- used by some critics to discriminate the tribal god of the ancient Hebrews from the Christian Jehovah. Yahweh or Yahwe is the spelling now generally adopted by scholars."
}
],
"jahvism": [
{
"partOfSpeech": "",
"text": "The religion or worship of YahwehJehovah), or the system of doctrines, etc., connected with it."
},
{
"partOfSpeech": "",
"text": "Use of Yahweh as a name of God."
}
],
"jahwist": [
{
"partOfSpeech": "",
"text": "Alt. of Jehovist"
}
]
}